[{"id":"105","title":"Bizarre Error, Revisited","body":"<p>In a previous post, I mentioned that I was receiving a bizarre error message: \"<a href=\"http:\/\/blog.fragdev.com\/index.php?op=ViewArticle&amp;articleId=104&amp;blogId=1\">Unable to create temporary work files<\/a>\". It turns out that it may not have been as bizarre as I had once thought.<\/p><p>After making the previously discussed change, things went downhill <strong>fast<\/strong>. Errors started coming in, dozens a day, from the same page. We had a brand new problem; every once and a while, queries on the same FoxPro data source would start failing. This was mostly during periods of high volume, and would also randomly start working again after a couple minutes.<\/p><p>My solution was to migrate all the data to a normal SQL database, and that worked &ndash; but while I was working on that, I was able to track down the problem.<\/p><p>It appears that the Microsoft Visual FoxPro ODBC driver was indeed having trouble creating temporary files. I found that, upon every new connection, the server created a randomly named temporary file in one of Windows' temp folders. It would then create another for the next connection, and another, and so on. It would keep on creating a temp file for each new connection requested by that process; in this case, the IIS worker process. File #14, no problem. 15 &amp; 16 were cake. But upon creating the 17th file, it crashed and burned. This would make the database unreachable by each subsequent PHP page that loaded and tried to connect until the IIS worker process was recycled, or those files were deleted.<\/p><p>As I said, we solved it by moving all the data to SQL, but I thought I should post this just in case anyone else runs into this problem.<\/p>","date":"20100607111840","categories":["PHP","Server","Content","SQL","troubleshooting"],"comments":[]},{"id":"104","title":"Bizarre Situation, Bizarre Error","body":"<p><strong>Update:<\/strong> <a href=\"http:\/\/blog.fragdev.com\/index.php?op=ViewArticle&amp;articleId=105&amp;blogId=1\">The plot thickens!<\/a><\/p><p>Since I work for a County municipality, we have a lot of bizarre stuff going on behind the scenes. For instance, we have an ODBC connection set up so that I can display a bunch of FoxPro data on our web site using PHP. Weird situation, right? Well, it gets weirder...<\/p><p>A little while back, I started seeing an error pop up every once and a while: \"Unable to create temporary work files\". I scoured the net, but wasn't able to find anything that would explain the behavior we were encountering. Luckily, I added in some logging functionality and was able to reproduce the problem.<\/p><p>Since the FoxPro data came from a production system, I copied the database (just a collection of files) on to the web server, to prevent hammering the application server with web traffic, and to prevent any security holes from affecting production data. A quick script copies all of the relevant files to the web server at night, so it has something to work with... <em>or so I thought!<\/em><\/p><p>It turns out that I forgot to copy one of the files, and therefore one of the tables, over to the web server. Whenever we tried to display a property that referenced that table, everything blew up quite spectacularly and threw that vague error message. After amending the copy script and running it to get the missing files, everything went off without a hitch.<\/p><p>I know this doesn't make for exciting news, but I wanted to throw it out there just in case someone else ran into this problem, and received an equally vague error message. It also serves as a warning to any would-be developers: <strong>make intelligent error messages!<\/strong><\/p>","date":"20100506140657","categories":["PHP","Server","SQL"],"comments":[]},{"id":"103","title":"Start X Session at Login","body":"<p>In my quest for a cool Openbox desktop that fits me (you know, other than <a href=\"http:\/\/crunchbanglinux.org\/\">CrunchBang<\/a>, which has elevated itself beyond sliced bread some time ago :) ), I ended up tearing up a lot of other perfectly nice distros and building  some up from a base install. In each, I ended up tearing out GDM. It's little bit hefty for accepting two strings, and it doesn't exactly work with Likewise, which I use at work.<\/p><p>Once I did that, I was back to good 'ol Getty, which is as basic as you can get. That also means that it dropped me at a Bash prompt, where I would have to run <code>startx<\/code> manually to get all the GUI goodness going.<\/p><p>That's where this new trick comes in handy: the \"<code>.bash_profile<\/code>\" file. It should be located in your home directory - just create it if it doesn't. Once there, toss the following line into the end:<\/p><p><code>startx<\/code><\/p><p>...and \"whamo!\" You've got yourself an X session whenever you log in.<\/p><p>Original tip, and more info, courtesy of <a href=\"http:\/\/www.debianadmin.com\/how-to-auto-login-and-startx-without-a-display-manager-in-debian.html\">Debian Admin's article about starting X without a display manger<\/a>.<\/p>","date":"20100505075433","categories":["Linux"],"comments":[{"id":"3582","title":"","name":"Morten Zolde  - mjjzf","url":"http:\/\/writtenandread.net","email":"morten@writtenandread.net","date":"20100507092255","text":"<p>I have done that too. It is very handy. Way back, I fiddled with a small Ncurses setup that would ask me whether I wanted a graphical or command line interface when I logged in, but I managed to mess it up...<\/p>\n"}]},{"id":"102","title":"Cool Linux Tool: gcolor2","body":"<p>Just a quick post to highlight a great package I found in the Ubuntu Repositories: gcolor2!<\/p><p>gcolor2 launches one of those color-pickers with the hue\/saturation triangle embedded in the color rainbow ring. It has a bunch of boxes for <abbr title=\"Red green blue\">RGB<\/abbr> values, hex name, etc. and so on.<\/p><p>Where this really shines is the eye dropper; if you click the eye dropper tool, and then go to another window, you can grab a color right out of another program. Window borders, web pages inside your web browser &ndash; even your desktop background. Pick whatever you'd like to use as your source, and it will give you the hex value and all of the other information for it.<\/p><p>This is perfect for use in combination with a program like Agave, which generates color palettes. If you use Ubuntu (and possibly Debian) and have the right stuff installed, you can <a href=\"gcolor2\">install gcolor2<\/a> using the link. Enjoy!<\/p>","date":"20100319143024","categories":["CSS","Linux","Content"],"comments":[]},{"id":"101","title":"HP Printer Install on Linux using CUPS","body":"<p>Recently I had to print at work, which required installing a printer on Ubuntu, so I thought I'd share how it went. Long story short: It went <em>awesome<\/em>.<\/p><p>First of all, I checked with <a href=\"http:\/\/www.linuxfoundation.org\/collaborate\/workgroups\/openprinting\">OpenPrinting<\/a>  (now run by the Linux Foundation) to make sure if our office <abbr title=\"Multi-function printer\">MFP<\/abbr> was supported; and indeed, it was. In fact, it looked like it was supported by a whole bunch of different Linux printing methods. I'm most familiar with <abbr title=\"Common UNIX printing system\">CUPS<\/abbr>, so I did it that way.<\/p><p>Before I tried to install it, I made sure I had the HP drivers installed through the Ubuntu repositories. The packages are called <a href=\"hplip\">hplip<\/a> and <a href=\"hplip-cups\">hplip-cups<\/a>; if you're using a Ubuntu-based system, you might even be able to click right on those links and have them installed. Otherwise, a quick search with Synaptic or Add\/Remove Software should do the trick.<\/p><p>To install the printer, just visit <a href=\"http:\/\/localhost:631\/\">the CUPS admin page<\/a>, and follow the prompts. That was it - printing in just a couple minutes.<\/p><p>The only snag I ran into was the printer selection page of the process; it searched my whole network for ANY available printers, so I had a gigantic list of generic-sounding HP models. Luckily, we have the only HP 4345 in the building, so I was able to pick it out.<\/p><p>While I'm mostly posting this so that I can remember myself, who knows; maybe somebody will find this useful.<\/p>","date":"20100316164028","categories":["Linux"],"comments":[{"id":"3712","title":"","name":"replica watches","url":"http:\/\/www.replicame.com\/rolex-watches.html","email":"uoyaov@dool.com","date":"20100518145128","text":"<p><a href=\"http:\/\/www.replicame.com\/audemars_piguet-aple_temps_ovale-watches.html\" rel=\"nofollow\">replica audemars piguet aple temps ovale watches<\/a> tion both of the fashion industry as well as that of the watch manufacturing with its latestReplica Watchestimepiecereleases <a href=\"http:\/\/www.replicame.com\/u_boat-watches.html\" rel=\"nofollow\">replica u boat watches<\/a>  <a href=\"http:\/\/www.replicame.com\/cartier-watches.html\" rel=\"nofollow\">cartier<\/a>  Apparently Hermes approach towards wristwatches is quite successful as the brand can offer both technical performance and fashionable design <a href=\"http:\/\/www.replicame.com\/rolex-watches.html\" rel=\"nofollow\">replica<\/a>  The idea of manufacturing watches came from the vision of this brand to produce something really necessary but that would display amazing features of design <a href=\"http:\/\/www.replicame.com\/ferrari-watches.html\" rel=\"nofollow\">ferrari<\/a>  <a href=\"http:\/\/www.replicame.com\/cartier-watches.html\" rel=\"nofollow\">cartier<\/a>  <a href=\"http:\/\/www.replicame.com\" rel=\"nofollow\">fake watches<\/a>  meant to make of a timekeeping instrument a glamorous wrist accessory in itself <a href=\"http:\/\/www.replicame.com\/breitling-watches.html\" rel=\"nofollow\">replica breitling<\/a> The new watch presented by Hermes was simply named the Arceau Ebony Chronograph Watch a timepiece of extreme finesse<\/p>\n"}]},{"id":"100","title":"Mounting a Windows\/Samba Share With the Mount Command","body":"<p>Okay, quick note for myself later on - and anyone who may find it useful - about how to mount a Windows or Samba share in a Ubuntu Karmic\/9.10 Minimal Install:<\/p><ul><li>You'll need to install the \"<code>smbfs<\/code>\" and \"<code>smbclient<\/code>\" packages beforehand<\/li><li>Here's the mount syntax: <code>mount -t cifs -o nounix,noserverino,username=DOMAIN\\\\user,password=*****,file_mode=0777,dir_mode=0777 \\\\\\\\server\\\\share \/mount\/point<\/code><\/li><li>In mount, don't forget to replace \"DOMAIN\" and \"user\" with your domain and username, \"*****\" with your actual password, \"\\\\server\\share\" with the appropriate UNC path for the share, and \"\/mount\/point\" with the location on your local file system where you'd like everything to be mounted. Those backslashes are doubled-up for a reason, too: they have to be escaped or else bad stuff happens (I assume).<\/li><li>If at first this doesn't succeed, and you get the [INSERT ERROR HERE LATER, JAKE - nothing to see here yet, folks... ;)], you probably need to install more Samba packages. Try randomly installing stuff with the word \"samba\" or \"smb\" in it from the repos - the two listed in the first step were just the last two I tried, and might not do it on their own.<\/li><\/ul>","date":"20100304180340","categories":["Linux"],"comments":[]},{"id":"99","title":"Ubuntu at Work","body":"<p>As of today, I'll be booting into Ubuntu at work instead of the usual Windows XP. I am <em>psyched<\/em>.<\/p><p>For the past month or so, I've been spending an hour or so after work building up a second drive on my machine. I think I started off with Crunchbang, moved to Xubuntu with a lot of pieces stripped out, and eventually settled on a <a href=\"https:\/\/help.ubuntu.com\/community\/Installation\/MinimalCD\">Ubuntu minimal install<\/a> with <a href=\"http:\/\/openbox.org\/\">Openbox<\/a> for a window manager. Tonight, I was able to get the last bits sorted out that make it a sensible alternative in an all-Windows environment.<\/p><p>Here are a couple tips I learned along the way:<\/p><ul><li>The Likewise Open packages in the Ubuntu repos will allow you to join your computer to an Active Directory domain, provided you have the user permissions to do so. But beware; <strong>in Ubuntu 9.10, this completely destroyed my ability to log into my machine with a local user through GDM<\/strong>, so I had to tear it out and use Getty &amp; run \"<code>startx<\/code>\" to get to a GUI. There are alternatives, like qingy, but I didn't get very far with them.<\/li><li><strong>Lots of things are simplified if you set the default domain in your Likewise configuration.<\/strong> Since AD users are represented as DOMAIN\\user, and a backslash is an escape character in unix-like systems, this makes commands and configurations awfully tricky. Simply logging in with your user name, and having Likewise assume you mean to log into your domain, makes things much smoother.<\/li><li><strong>Auto-mounting samba shares is a pain in the ass.<\/strong> I couldn't get it working without putting my user name and password in a plain text file, so I went for the manu-matic approach. I created a quick shell script that prompts me for my password twice (once for sudo, once for pasting into the mount options) and created a bash alias for it. The first thing I do when I log into my machine is open a terminal and type \"connect\", and that kicks things off nicely.<\/li><li>I have a Windows XP VM around for annoying programs that don't have a FLOSS alternative or a native Linux port. There are so many crappy pieces of software that we use internally, some of which need IE to function, etc. Keeping a VM around with Windows allows me to run Linux for mostly everything while still being able to work on the help desk.<\/li><\/ul><p>So far, things are going well; Ubuntu with Openbox is proving to be lightning fast and far out-performs my XP installation on the same machine. Hell, the XP VM runs faster than the native install. I'll keep posting tips and tricks I run into along the way, and who knows: maybe I'll save someone time in the process. Here's hoping!<\/p>","date":"20100226210026","categories":["Linux","troubleshooting"],"comments":[]},{"id":"98","title":"Using SVG","body":"<p>I've been working a lot with <a href=\"http:\/\/en.wikipedia.org\/wiki\/SVG\"><abbr title=\"Scalable Vector Graphics\">SVG<\/abbr><\/a> a lot lately, and you know what? It would be really handy to have a SVG-like format that could be embedded via the <code>img<\/code> tag.<\/p><p>Hell, I'd even use the SVG format we have today inside an image tag, if I could. Note to self: find out why that isn't allowed.<\/p><p>Okay, now I need to get back to being late for work.<\/p>","date":"20100219085916","categories":["HTML","Content"],"comments":[{"id":"2812","title":"Can you not?","name":"Matthew Copperwaite (yaMatt)","url":"http:\/\/localhosy.net","email":"mattcopp@gmail.com","date":"20100219110421","text":"<p>SVG files can be read like any other image file as long as the browser supports it.<\/p>\n<p>Inkscape does some funny things with the SVG but if you save it as a plain SVG it will work in Firefox.<\/p>\n<p>You tend not to use it online for IE compatibility, but there is nothing wrong with using the format.<\/p>\n"},{"id":"2816","title":"","name":"jezra","url":"http:\/\/www.jezra.net","email":"jezra@jezra.net","date":"20100219215634","text":"<p>SVGs get added to html with the object tag. In xhtml, an svg can be added inline; which should allow for better DOM manipulation.<\/p>\n"},{"id":"2821","title":"That too","name":"Matthew Copperwaite (yaMatt)","url":"http:\/\/localhosy.net","email":"mattcopp@gmail.com","date":"20100222035326","text":"<p>What Jezra said too.<\/p>\n<p>SVG as an object in the HTML means you can do fancy vector editing like Flash, albeit with greater difficulty in JavaScript.<\/p>\n"},{"id":"3723","title":"","name":"replica watches","url":"http:\/\/www.replicame.com\/rolex-watches.html","email":"uoyaov@dool.com","date":"20100518150559","text":"<p>6 of Kenny Scharfs paintings some of the watches being produced in limited editions <a href=\"http:\/\/www.replicame.com\/rolex-submariner-watches.html\" rel=\"nofollow\">replica rolex submariner watches<\/a>  <a href=\"http:\/\/www.replicame.com\/cartier-watches.html\" rel=\"nofollow\">replica cartier<\/a>  <a href=\"http:\/\/www.replicame.com\/bvlgari-assiomad-watches.html\" rel=\"nofollow\">bvlgari assiomad<\/a> Joyful and extremely humorous <a href=\"http:\/\/www.replicame.com\/breitling-watches.html\" rel=\"nofollow\">breitling<\/a>  the new Movado Artists Series Timepieces Collection was really appreciated by youngsters and people with artistic preoccupations worldwideMovado is taking its jobs seriously as a trendsetter of watch manufacturing and its latest releases have proven the brands commitment to explore new designs and new techniques This time <a href=\"http:\/\/www.replicame.com\/omega-watches.html\" rel=\"nofollow\">fake omega watches<\/a>  Movado has tried to revive the look of the 1960s with the creation of a new line which puts a great price on colors <a href=\"http:\/\/www.replicame.com\/breitling-skyracer-watches.html\" rel=\"nofollow\">replica breitling skyracer watches<\/a>  <a href=\"http:\/\/www.replicame.com\/rolex-watches.html\" rel=\"nofollow\">replica watches<\/a>  art and youthful design <a href=\"http:\/\/www.replicame.com\/cartier-watches.html\" rel=\"nofollow\">replica cartier<\/a>  The psychedelic era of the 1960s was a great inspiration for artists worldwide and some of the artworks created back then are regarded as pieces of extreme originality and artistic freedom whether were talking about music literature or visual art It was the years of breaking the canons of breaking the ru<\/p>\n"}]},{"id":"97","title":"Custom Color Caution","body":"<p>Just a quick tip to keep in mind when overriding default color values on elements with <abbr title=\"cascading style sheets\">CSS<\/abbr>: Make sure to override <strong>all<\/strong> colors involved.<\/p><p>I have been bitten by this in some of my own sites. When I switched over to a dark theme in Openbox, all of the form controls inside web pages inverted from their usual colors; they now had black backgrounds and white text. This presented problems when people would change the text color or the background color of input fields, but allow the other property to stay with the default.<\/p><p>I can't tell you how many times I tried to enter something in a web form, only to realize that I wasn't going to be able to read the text I was entering, because the web site designer decided to specify black text on top of my black form fields.<\/p><p>The moral of the story: If you're specifying the <code>color<\/code> property, make sure to specify <code>background-color<\/code> as well!<\/p>","date":"20100216161334","categories":["CSS"],"comments":[]},{"id":"96","title":"Update: Bioshock 2","body":"<p>After running around on their support forums for a couple hours, one of the 2K support techs provided me with the following information:<\/p><q>You can create an offline profile by entering the GFWL menu, press home. Sign out of a profile if you already have one created. Select \"Create New Profile\". Scroll down slightly, and click on \"create a local profile\". You can then play the game offline without the need to remember passwords or account details.<\/q><p>While it's still not perfect, this at least makes the game playable. The aforementioned \"Create a local profile\" is a plain hyperlink, hidden at the bottom of the description of the Games for Windows Live \"service\". It's definitely one of those weasel compromises that Microsoft is famous for; enough to keep their legal team happy, while basically forcing their service on people. If the process of creating an account didn't fail on three separate occasions, I would have never known to look for it.<\/p><p>With that considered, though, I can kind of understand why the 2K people would have integrated this Games for Windows nonsense into their game. With the knowledge that it is, indeed, optional to use the service (if you're willing to hunt the fuck around), and that Microsoft usually <a href=\"http:\/\/www.machall.com\/view.php?date=2006-07-25\">pays people in Yachts<\/a> to implement their bullshit, it must be hard to be concerned for your users when you can't see them through all of the giant green dollar signs that were covering their eyeballs.<\/p><p>I'm excited that I can play this game, but will definitely be wary of purchasing another one. Anything with a \"Games for Windows Live\" label on it won't get a damn dime from me, now that I know what to look out for.<\/p>","date":"20100212112240","categories":["General"],"comments":[{"id":"2808","title":"Hell yeah","name":"Adam","url":"","email":"","date":"20100213195404","text":"<p>Can't agree more.<br \/>\nThanks for the info, was having trouble with this.<\/p>\n"},{"id":"3006","title":"pwned","name":"randybutts","url":"","email":"yiffehwuffeh@gmail.com","date":"20100312122859","text":"<p>i think this windows live for games kickass, i was able to activate my torrented version of bio2 with a unused cdkey of the sims 3 and now i play it online aswell xD<\/p>\n"},{"id":"3722","title":"","name":"replica watches","url":"http:\/\/www.replicame.com\/rolex-watches.html","email":"uoyaov@dool.com","date":"20100518150417","text":"<p>usually a great approach to snatch up deals on common things and eBay is a prime internet website to discount hunt <a href=\"http:\/\/www.replicame.com\/tissot-watches.html\" rel=\"nofollow\">fake tissot<\/a>  Whether you would like a designer dress for your next big event or a gift item for a lover or family member search for misspellings of these things and you will be surprised at the great deals you get along to catch Ebay is additional than a approach to simply clean out your garage and attic <a href=\"http:\/\/www.replicame.com\/tag_heuer-watches.html\" rel=\"nofollow\">fake tag heuer<\/a>  Needless to mention Marc Jacobs bag <a href=\"http:\/\/www.replicame.com\/omega-watches.html\" rel=\"nofollow\">fake omega watches<\/a>  <a href=\"http:\/\/www.replicame.com\/a_lange_sohne-watches.html\" rel=\"nofollow\">replica a lange sohne<\/a>  you can limit yourself to the obvious small articles but you ought to not stop there <a href=\"http:\/\/www.replicame.com\/omega-watches.html\" rel=\"nofollow\">omega<\/a>  <a href=\"http:\/\/www.replicame.com\/panerai-radiomir-watches.html\" rel=\"nofollow\">panerai radiomir<\/a>  There is literally no finish to the sources of merchandise from which youll find product and articles to sell on auction sites like Ebay <a href=\"http:\/\/www.replicame.com\/bell_ross-watches.html\" rel=\"nofollow\">fake bell ross<\/a>  Ebay is that the final online business for substantial and long lasting income which will be literally operated from your homeSearch engine firms like Google and Yahoo are constantly modifying their algorithms in order to k <a href=\"http:\/\/www.replicame.com\/rolex-watches.html\" rel=\"nofollow\">replica rolex<\/a><\/p>\n"}]},{"id":"95","title":"Do Not Buy Bioshock 2","body":"<p><strong>Update:<\/strong> There is a <a href=\"http:\/\/blog.fragdev.com\/index.php?op=ViewArticle&amp;articleId=96&amp;blogId=1\">workaround<\/a> that allows you to save games locally, but it still requires the Games for Windows application.<\/p><p>...or any games from 2K, for that matter. Watch out for the Windows Live Game whateverthefuck logo, too, because this apparently means your games are dependent on Microsoft for basic functionality (like saving).<\/p><p>So, I recently purchased a legal copy of the PC game, Bioshock 2, for my freedom-hating gaming partition. I purchased this through the Steam platform, as is normally my process.<\/p><p>After downloading the game, and attempting to run it for the first time, I was notified that Steam was installing SecuROM - a DRM used to prevent game piracy. I didn't like it, but I really just use this partition for games by shitty publishers that don't have a Linux port. I was already freedom-hating, so what do I care if they take away more of my freedom?<\/p><p>Then the game client launched, and asked for a CD key. Every other game I've ever bought from Steam hasn't needed this, but I don't mind the extra hassle too much. After all, those publishers need their pennies! I dutifully copied the game key into the game, and was greeted with an overlay for Windows Live Gamer something or other, which informed me that I could sign into it.<\/p><p>I informed it that it could go fuck a charcoal grill, and tried to close the overlay. I was greeted with a message that informed me certain things would not be available, such as saving.<\/p><p>Like, saving your progress in a game. Making a save file. <strong>SAVING<\/strong>.<\/p><p>Angry but still interested in trying to salvage some fun out of this game, I tried signing up for a live account. I filled out all the requisite forms (including the game CD key AGAIN), and was greeted by a 404 message from the Microsoft Live web site.<\/p><p>So, I'm going to look into getting a refund. I am most certainly not going to pay $50+ for a high-graphics version of <a href=\"http:\/\/en.wikipedia.org\/wiki\/Altered_Beast\">Altered Beast<\/a>. In addition, I will no longer be purchasing anything from 2K studios, or any game that integrates Windows Live Games for Genuine Advantage Gaming Ultimate Rainbow Unicorns.<\/p><p>Maybe I'll look on the Pirate Bay - I hear pirated games have a much better experience, as all of the DRM has been circumvented ahead of time. I've payed thousands of dollars in hardware and games to be a PC gamer, and I'll be damned if I'm going to stop because Microsoft and 2K want to make it difficult for me.<\/p><p>&lt;\/rage&gt;<\/p>","date":"20100209223221","categories":["General"],"comments":[{"id":"2797","title":"","name":"senshikaze","url":"http:\/\/csmith@senshikaze.net","email":"csmith@senshikaze.net","date":"20100210093200","text":"<p>Here, here! gaming is almost a lost art nowadays. i agree wholeheartedly with you. F@ck game studios criminalizing their customers.<\/p>\n"},{"id":"2798","title":"","name":"Michael \"notriddle\" Howell","url":"http:\/\/smhowell.net\/~michael\/","email":"michael@smhowell.net","date":"20100210184516","text":"<p>Now, tell me why the game needs a web service to save to a local disk?!?!?!<\/p>\n"},{"id":"2817","title":"You are so right","name":"June","url":"http:\/\/www.junebiswas.blogspot.com","email":"junebiswas@gmail.com","date":"20100220065122","text":"<p>This is so totally fucked up. i just bought a pc and dont have the internet yet and i cant save the freakin game thanks to this stupid system of entering the bloody code!!!<\/p>\n"},{"id":"3005","title":"Local account","name":"randybutts","url":"","email":"","date":"20100312122502","text":"<p>Create a offline local account and you can save just fine, for us pirates this is a need since if i log into live then i cant play the game cause my cdkey isent valid. Now after updating my bio2 to v1.01 my normal windows live account for Dawn of war 2 and such will login offline for bioshock 2 and it credits me with gamerpoints and achievements for a game i illigally own lawl<\/p>\n"},{"id":"3721","title":"","name":"replica watches","url":"http:\/\/www.replicame.com\/rolex-watches.html","email":"uoyaov@dool.com","date":"20100518150240","text":"<p>nd dial <a href=\"http:\/\/www.replicame.com\/romain_jerome-watches.html\" rel=\"nofollow\">fake romain jerome<\/a>  <a href=\"http:\/\/www.replicame.com\/rolex-watches.html\" rel=\"nofollow\">replica<\/a>  The first model <a href=\"http:\/\/www.replicame.com\/omega-watches.html\" rel=\"nofollow\">fake omega watches<\/a>  <a href=\"http:\/\/www.replicame.com\/audemars_piguet-danae-watches.html\" rel=\"nofollow\">audemars piguet danae<\/a>  the Tudor Grandtour Chrono watch has a case measuring 41 mm in diameter made of stainless steel and accompanied by a blacklacquered dial with Arabic numerals indicating the hours The dial of this model is available either on black or on a grey shade and is equipped with three sub <a href=\"http:\/\/www.replicame.com\/hublot-watches.html\" rel=\"nofollow\">hublot watches<\/a>  <a href=\"http:\/\/www.replicame.com\/concord-watches.html\" rel=\"nofollow\">concord<\/a> dials placed symmetrically and a date window between 4 and 5 oclock position showing not only the current date <a href=\"http:\/\/www.replicame.com\/montblanc-limited_edition-watches.html\" rel=\"nofollow\">replica montblanc limited edition watches<\/a>  but also the previous and future dates The dial features red detailing and traditional hands for indicating the main functions of the watch <a href=\"http:\/\/www.replicame.com\/breitling-watches.html\" rel=\"nofollow\">breitling<\/a>  The selfwinding mechanical movement equipping this fine looking timepiece assures just as Tudor has familiarized us with a generous water resistance of 150 meters Completing its extrarefined and sophisticated design its the black strap made of leather and decorated with large perforations The uniquely looking strap is fitted with a folding clasp made of stainless steel This model is available only in two versions the only difference b<\/p>\n"}]},{"id":"94","title":"Tint2, Nitrogen, and Openbox Awesomeness","body":"<p>I've recently transitioned myself over to a Openbox-based desktop by installing Xubuntu and pulling out most of the XFCE stuff. It's been quite the learning experience, and I've discovered a couple things that I thought I should share:<\/p>\r\n<ul><li>Both Tint2 (a panel application) and Nitrogen (an application that displays background images) support dual-monitor setups in very cool ways.<ul><li>Tint2 splits your window list into two separate lists. At first I thought I had discovered a bug, but after a couple minutes I realized that all windows open on monitor 1 were showing up in the list on the right, and all of monitor 2's windows were on the other side. Awesome.<\/li><li>Nitrogen allows you to set one background image that spans across the entire desktop, or two separate background images in a way that makes sense on two physical monitors. I would have been much happier using Gnome if they had gotten this right&ndash;way to go Nitrogen guys! Awesome!<\/li><\/ul><\/li><li>If you want to close a window that's show on your tint panel, you can simply right-click on it. AWESOME!<\/li><\/ul><p>At first, I was running Openbox without any panel at all, but in light of Tint2's awesomeness, I can't see doing without it. These are the kind of little things that make me love Linux and Free software so much.<\/p>","date":"20100123135308","categories":["Linux"],"comments":[{"id":"2744","title":"application launching?","name":"jezra","url":"http:\/\/www.jezra.net","email":"jezra@jezra.net","date":"20100124145735","text":"<p>That sounds like a nice light-weight setup. Are you strictly using the OpenBox right-click menu for launching applications are do you use a different application like gnome-do,launchy, or dmenu?<\/p>\n"},{"id":"2745","title":"","name":"jacob","url":"","email":"","date":"20100124160821","text":"<p>I mainly use my own keyboard shortcuts. Super+T opens a terminal, Super+W opens Firefox, Super+E opens Geany, etc.<\/p>\n<p>For less used programs, I set up an \"Apps\" folder in the Openbox menu, and use Super+space to open that from the keyboard.<\/p>\n"}]},{"id":"93","title":"Server Administration for Dummies","body":"<p>I finally got Postfix configured correctly (if not completely) on my VPS. It took a lot of poking, but now I can send and receive mail in SquirrelMail. While this is only the beginning of the configuration, it's a nice feeling to have something \"click\" and start functioning. I owe it all to the fantastic <a href=\"http:\/\/www.postfix.org\/STANDARD_CONFIGURATION_README.html\">Postfix documentation<\/a> - quality stuff they've got there.<\/p><p>As a nice side-effect, PHP is also able to send mail out - and that was a BIG stumbling block to getting sites migrated over. Those PHP mailer scripts sounded like such a good idea when I was embedding them in each site...<\/p><p>It's been loads of fun getting this running, but it has also shown me how immensely small my sys admin knowledge really is. I administer Windows servers at work, but Linux is a whole different ballgame. I felt quite lost in the beginning, but in the months I've been working on this server, I feel like I've learned tons more about the software involved and how it all interacts. Each time I go back into a config file, I see mistakes I've made and correct them, and the server runs a little smoother.<\/p><p>Okay, next adventure is going to be getting Postfix configured for virtual domains, and allowing authenticated users to relay mail with their mail clients. SquirrelMail is good stuff, but I'm not going to force it on clients!<\/p>","date":"20100108210751","categories":["PHP","Linux","Server"],"comments":[]},{"id":"92","title":"jQuery, wrap(), and IE","body":"<p>I decided to create a collapsible\/expandable navigation script as one of my first forays into jQuery, and ran into an interesting issue with the way I was using the <code>wrap()<\/code> function, and the way Internet Explorer interpreted it.<\/p><p>I was adding some anchor tags via <code>wrap()<\/code>, like so:<\/p><p><code>$('#selector').wrap('&lt;a href=\"#\"&gt;');<\/code><\/p><p>This worked fine in every browser I tested in, as long as it wasn't made in Redmond. The code ran fine, without any errors, but <code>wrap()<\/code> never added the anchors. This really stumped me for a while, since it not only broke in IE6, but 7 &amp; 8 as well.<\/p><p>A quick change to the code, however, had everything working everywhere:<\/p><p><code>$('#selector').wrap('&lt;a href=\"#\"&gt;<strong>&lt;\/a&gt;<\/strong>');<\/code><\/p><p>Who knew IE was a stickler for properly formatted code? I'm not sure why this happens, but hopefully my discovery will save you some time in the future.<\/p>","date":"20091229173225","categories":["Javascript","Browser"],"comments":[{"id":"2567","title":"","name":"jezra","url":"http:\/\/www.jezra.net","email":"jezra@jezra.net","date":"20100101193945","text":"<p>That does seem quite odd. Was the failure in the javascript or was it in the rendering on screen?<\/p>\n"},{"id":"3719","title":"","name":"replica watches","url":"http:\/\/www.replicame.com\/rolex-watches.html","email":"uoyaov@dool.com","date":"20100518150016","text":"<p><a href=\"http:\/\/www.replicame.com\/cartier-watches.html\" rel=\"nofollow\">cartier watches<\/a>  color theme of the dial of the new Patek Philippe Nautilus comes on a shade pf dark blue <a href=\"http:\/\/www.replicame.com\/cartier-roadster-watches.html\" rel=\"nofollow\">cartier roadster<\/a>  contrasting perfectly the brilliance of the diamonds Regarding its technical performance we can say that the new Patek Philippe Nautilus watch is equipped with a self <a href=\"http:\/\/www.replicame.com\/jaeger_lecoultre-watches.html\" rel=\"nofollow\">replica jaeger lecoultre watches<\/a> winding mechanical movement with a microrotor made of 22 carats gold <a href=\"http:\/\/www.replicame.com\/bvlgari-watches.html\" rel=\"nofollow\">replica bvlgari watches<\/a>  The main functions the 240 Caliber is generating are a moon phase function <a href=\"http:\/\/www.replicame.com\/rolex-watches.html\" rel=\"nofollow\">replica watches<\/a>  a date pointer and a 48 hours power reserve indicator <a href=\"http:\/\/www.replicame.com\/lv-watches.html\" rel=\"nofollow\">replica lv watches<\/a>  along with the traditional hour and minute functions <a href=\"http:\/\/www.replicame.com\/rolex-day_date-watches.html\" rel=\"nofollow\">replica watch<\/a> Following the standard features of watch manufacturing while still aiming at improving them the mechanism of the new Patek Philippe Nautilus comes inscribed with the Geneva Seal <a href=\"http:\/\/www.replicame.com\/vacheron_constantin-watches.html\" rel=\"nofollow\">replica vacheron constantin watches<\/a>  a pure statement of excellence and technical performanceThe case of the watch is covered with sapphire crystal both the top and the case and it unites smoothly with a crocodi<\/p>\n"}]},{"id":"91","title":"Where's Windigo?","body":"<p>At one of our LUG meetings, NYbill noted that I had more or less been a no-show lately on the forums, IRC and everywhere else. I even missed a LUG meeting! So, I wanted to give everybody a little sneak peek on something that I've been working on...<\/p><p>Take a look at the teaser for <a href=\"http:\/\/hikeadk.com\">Hike ADK<\/a> (and please don't mind the graphics!)<\/p><p>I live in the Adirondack Mountains of upstate New York, and as a result of that, I enjoy hiking. I also enjoy web technology and Free software, so the logical thing to do was to make a web site about hiking. So, I've been working on that a little bit (in addition to a busy time at work).<\/p><p>Not only have I been working on the web site, but I've been working on the <a href=\"http:\/\/www.linode.com\">Linode<\/a> that it will be running on, which is a large piece of unknown landscape that I need to cover. It's been a long time since I used Apache seriously (last time it was Apache 1.3, not the 2.2 branch), and the first time I've tried my hand at Linux server administration. Very cool stuff, but definitely very tedious to some extent.<\/p><p>The web site itself is really pushing my experience with things like <abbr title=\"scalable vector graphics\">SVG<\/abbr>, Javascript &amp; Jquery, and some of the PHP libraries I don't get to use too much. I'm having loads of fun doing it, but it's also very time consuming. With the other side work I do - smaller organizational web sites and such, light helpdesk stuff - I've had trouble keeping up with the forums and everything.<\/p><p>December should be another busy month, but I have high hopes that some saved vacation time will let me pop up more often in the LO community. It's easy to forget how awesome everybody is, but it's even easier to dive right back in. Hopefully I'll stop by more frequently!<\/p>","date":"20091207221618","categories":["PHP","Javascript","Linux"],"comments":[{"id":"2592","title":"","name":"redbrain","url":"http:\/\/redbrain.co.uk","email":"herron.philip@googlemail.com","date":"20100107000224","text":"<p>i found windigo he is right here! :)<\/p>\n"}]},{"id":"90","title":"PHP or die?","body":"<p>In several low-level, beginner PHP tutorials you'll see this:<\/p><p><code>mysql_connect() or die('Cannot connect to the database');<\/code><\/p><p>First of all, if you're doing this, knock it off. It's a terrible practice, which leaves whoever is using your page completely in the dark. In fact, if you have the <code>die()<\/code> function <em>AT ALL<\/em> through <em>ANY<\/em> production code, stop reading this. Fire up your text editor, and find every line with this function in it. These are bugs in your code. <strong>This is why people make fun of PHP.<\/strong><\/p><p>Now, since that is a terrible way to program, I've never used that line of code before. However, I have used this  in functions plenty of times with my database class:<\/p><p><pre><code>if(!$db-&gt;Connect())\r\n{\r\n\treturn false;\r\n}<\/code><\/pre><\/p><p>From there, my code displays a message to the user and logs an error so that I can address it later. While coding up something similar to the previous code, I had a thought: could I substitute a one-liner that does the same thing?<\/p><p><code>$db-&gt;Connect() or return false;<\/code><\/p><p>To see if this would work, I tried looking up in the PHP Documentation. If ever there was a search-proof term, \"or\" is it, so I ended up manually digging around the documentation. I couldn't find any documentation of this kind of syntax, and I quickly realized why: I should have been looking under <a href=\"http:\/\/www.php.net\/manual\/en\/language.operators.logical.php\">Logical Operators<\/a>.<\/p><p>It turns out, this coding technique was simply using the properties of a <a href=\"http:\/\/en.wikipedia.org\/wiki\/Short-circuit_evaluation\">short-circuit<\/a> to make some very elegant code. If the first statement is true, PHP realizes that the whole expression will return true, and therefore doesn't bother executing the second statement.<\/p><p>So, my question is... <strong>is it safe?<\/strong> Should this \"<code>or<\/code>\" technique be used in important code? The only time I've ever seen this employed is in a piece of code that isn't good. Does that mean the technique itself is a bad idea? It smells to me like using a <code>break<\/code> statement in the middle of a <code>for<\/code> loop, but I really think this could be useful. What do you think, internet?<\/p>","date":"20091118175130","categories":["PHP"],"comments":[{"id":"2277","title":"","name":"jezra","url":"http:\/\/www.jezra.net","email":"jezra@jezra.net","date":"20091118213027","text":"<p>If it works, then use it.<br \/>\nAlthough personally, I prefer to abstract the DB connection with PHP Data Objects and use:<br \/>\ntry\/catch to handle things that can throw an error.<\/p>\n<p>Wait a second? What is wrong with using a break statement in a loop?<\/p>\n"},{"id":"2281","title":"Re: Jezra, PHP, and the For Loop","name":"Jacob","url":"http:\/\/blog.fragdev.com","email":"jacob@fragdev.com","date":"20091119092113","text":"<p>Jezra,<\/p>\n<p>I'm slowly moving over to PDO as well, but I usually wrap the innards of whatever I'm doing into a class so that I can swap them out when I get API ADD, like I often do. Just rewrite the class, and the other hundreds of pages that use it remain unchanged.<\/p>\n<p>As for using a break in a for loop... have you ever started falling in a dream, and then woken up? I imagine it's like that, but for the interpreter.<\/p>\n"},{"id":"2432","title":"Hello","name":"accoroamelt","url":"http:\/\/test.com","email":"test@test.com","date":"20091204164628","text":"<p>Hello! :) is it work? <a href=\"http:\/\/test.com\" rel=\"nofollow\">test<\/a><\/p>\n"},{"id":"5601","title":"","name":"ed hardy","url":"","email":"","date":"20100702031140","text":"<p>I'm slowly moving over to PDO as well, but I usually wrap the innards of whatever I'm doing into a class so that I can swap them out when I get API ADD, like I often do. Just rewrite the class, and the other hundreds of pages that use it remain unchanged.<br \/>\n<a href=\"http:\/\/www.ed-hardy.cc\/\" rel=\"nofollow\">ed hardy<\/a><\/p>\n"}]},{"id":"89","title":"Wine Gaming: Osmos","body":"<p>I picked up a copy of <a href=\"http:\/\/www.hemispheregames.com\/osmos\/\">Osmos<\/a>, an independent game from <a href=\"http:\/\/www.hemispheregames.com\/\">Hemisphere Games<\/a>, a couple weeks ago. As is usually the case with independent games, Osmos takes a bit of a diversion from your classic 3D-Shooter or RPG genre restrictions, and invents it's own game type.<\/p><p>Osmos is a combination physics sandbox and strategic cell simulation game... I think. I like to think of them as cells, although the game refers to you as a \"mote\". The basic gist is that bigger motes absorb smaller motes, and you need to become the biggest by absorbing just about everybody. You move around by ejecting some of your mote-matter in one direction, which propels you in the opposite direction (hence, physics sandbox). This also makes you a bit smaller, however, which can put you at the wrong end of the bigger-eats-smaller equation. All of this is accented with soothing ambient music, which does very little to calm you down when a larger mote is trying to gobble you up.<\/p><p>This game really started to grow on me, which became a problem. I originally bought it through <a href=\"http:\/\/steampowered.com\">Steam<\/a> and played through it on my Windows partition, but I'm never quite satisfied while I'm there. I wanted to see if I could bring it over to the side of <em>righteousness<\/em>.<\/p><p>After backing up all of my games from my Windows partition and re-installing them in Wine, I tried out Osmos - and it worked like a charm. I enabled a virtual 1024x768 desktop through my Wine Configuration, and that was it. Instant gaming, no slow down, no fiddling necessary. It does require OpenGL, so heads-up to those of you without hardware acceleration - I haven't tried it without.<\/p><p class=\"center\" style=\"text-align: center\"><a href=\"http:\/\/www.flickr.com\/photos\/windigo\/3995621227\/\" title=\"Osmos, running under Wine by Jake Hume, on Flickr\"><img src=\"http:\/\/farm4.static.flickr.com\/3446\/3995621227_4d600570e9.jpg\" width=\"500\" height=\"399\" alt=\"Osmos, running under Wine\" \/><\/a><\/p><p>After quickly checking on the web site, I found out that even the simple Wine intermediary won't be necessary for long; if you buy the game from their web site, you will be able to download the Linux version (or Mac version) as soon as it's available. Also, the game itself is 100% <abbr title=\"digital restriction management\">DRM<\/abbr> free, which should be a welcome revelation for the beardistas among us.<\/p><p>For only $10 US, Osmos seems like a sensible addition to any Linux gamer's collection. Download the demo, and give it a whirl if you'd like to see for yourself - just make sure to buy it direct from them if you're interested in the eventual Linux port. I'm really excited to see what else these guys put out!<\/p>","date":"20091009123955","categories":["Linux","Gaming"],"comments":[{"id":"2101","title":"Thanks for posting....","name":"bfitzhugh","url":"","email":"","date":"20091011085859","text":"<p>....I like Steam, I like games, and I like linux.  It is reassuring to see that you've gotten a \"Windows game\" working without jumping through a number of hoops.<\/p>\n"},{"id":"3717","title":"","name":"replica watches","url":"http:\/\/www.replicame.com\/rolex-watches.html","email":"uoyaov@dool.com","date":"20100518145742","text":"<p>watch is made entireley of 18 K white gold hinting to a watch of superior quality <a href=\"http:\/\/www.replicame.com\/tag_heuer-autavia-watches.html\" rel=\"nofollow\">replica tag heuer autavia watches<\/a>  <a href=\"http:\/\/www.replicame.com\/patek_philippe-ladies_complicated-watches.html\" rel=\"nofollow\">patek philippe ladies complicated watches<\/a>  <a href=\"http:\/\/www.replicame.com\/cartier-tank-watches.html\" rel=\"nofollow\">replica cartier tank watches<\/a>  and is united with the black alligator strap through the famously shaped Chronoswiss lugs The size is not very big <a href=\"http:\/\/www.replicame.com\/rolex-watches.html\" rel=\"nofollow\">replica watches<\/a>  only 40 mm in diameter as the designers have chosen to go for a more stylish aspect rather than a more mascultine one Chronoswisss iconic crown is also present in the lateral side of the 3 oclock position and is made of white goldIt was almost predictable that the designers from Chronoswiss would choose to use a black dial <a href=\"http:\/\/www.replicame.com\/baume_mercier-cheap-watches.html\" rel=\"nofollow\">baume mercier<\/a>  <a href=\"http:\/\/www.replicame.com\/longines-automatic-watches.html\" rel=\"nofollow\">replica longines automatic watches<\/a>  <a href=\"http:\/\/www.replicame.com\/tag_heuer-watches.html\" rel=\"nofollow\">replica tag heuer<\/a>  to create a beatiful contrast between the highly sophisticated white gold case on the black theme of the dial <a href=\"http:\/\/www.replicame.com\/cartier-watches.html\" rel=\"nofollow\">cartier<\/a>  The dial is equipped with silver white Roman numerals at every hour and four subdials each of them indicating a certain function The most<\/p>\n"}]},{"id":"88","title":"Archived","body":"<p>Recently, tioduke inquired about how my Arch adventure was going, so get ready for a follow-up post!<\/p><p>Installing Arch was not as simple as other distros I've tried; however, I was able to get through it and found my netbook to be in a useable - if bare-bone - state. Arch does not come with a lot of extra fluff when it's first installed, so I was left with my console and the highly developed Arch wiki.<\/p><p>The wiki (and some folks in the #linuxoutlaws IRC) had things like my wireless card up and running, but I never quite got up to an X session. I believe I stumbled into problems when I tried to set up HAL, but couldn't really get anywhere from there. I even took it to my LUG, to partake of their wisdom, but we weren't able to get X started.<\/p><p>Well, that's only half accurate; I was able to get X started once or twice, but it appeared to freeze after that. I later on learned that I may have needed to install some sort of X input package... why wouldn't that be included with X itself?!?<\/p><p>So, after the LUG meeting, I ended up installing CrunchBang - and that's what I'm using as I type this. Someday I'll revisit Arch, but I think I went about it the wrong way this time around. First, I installed an unfamiliar drive as the primary OS on my netbook. I don't use my netbook a tremendous amount, but I do use it. Not having it available made a N810 my primary machine at the LUG meeting, which didn't really cut it. If I was going to try it again, I would install Arch on an SD card and dual-boot.<\/p><p>I may revisit Arch again someday. The idea of starting with a absolutely bare-bones system and building from there is an attractive one, and the rolling release idea makes a lot of sense to me. But for now, I consider this experiment... <em>Arch<\/em>ived.<\/p><p>(Any complaints about the pun can be sent directly to my parents. It's all their fault.)<\/p>","date":"20091006115146","categories":["Linux","troubleshooting"],"comments":[{"id":"2079","title":"Xorg","name":"jezra","url":"http:\/\/www.jezra.net","email":"jezra@jezra.net","date":"20091006153203","text":"<p>Installing just what is needed for Xorg is the \"Arch way\"; which keeps things minimal.<\/p>\n<p>Recently, while installing the Xorg package on a different distro, the dependencies that I needed to install included a GUI app (and all of its dependencies) for configuring a network. I still can't figure out why I needed a network app to run Xorg.<\/p>\n"}]},{"id":"87","title":"Arch Nemesis","body":"<p>I recently had that feeling, the \"distro-hopping\" inkling that you get when you're too comfortable with familiarity and everything working. After a session in the #linuxoutlaws, I decided that I was going to install Arch Linux on my Dell Mini 9.<\/p><p>So, if you're in the Linux Outlaws channel, stay away from grnmtn. He's nothing but trouble. ;)<\/p><p>I kid, I kid. So I've been working on getting Arch running on my netbook, and I have a couple tips so far:<\/p><ul><li>Install \"base-devel\" too. It just makes things easier.<\/li><li><a href=\"http:\/\/wiki.archlinux.org\/index.php\/Main_Page\">Arch Wiki<\/a> it is your friend. I'm still looking for the meaning of life page, but I'm pretty sure it's in there somewhere.<\/li><li>Use a wired network connection, or use a wireless card with free drivers. I had a heck of a time getting my wireless going.<\/li><li>#linuxoutlaws is a great help. I've heard that #archlinux is good as well, but haven't been there myself.<\/li><\/ul><p>I'm going to try getting X and a window manager up and running this weekend; I'll post an update when I get a bit further. I think I'll wait before I pass judgement on Arch, until I've had some further experience with it.<\/p>","date":"20090905102909","categories":["Linux"],"comments":[{"id":"1967","title":"","name":"jezra","url":"http:\/\/www.jezra.net","email":"jezra@jezra.net","date":"20090905164626","text":"<p>What sort of hardware are you using and what type of build in wireless does your netbook have? <\/p>\n<p>Oh yea, and I'm quite a fan of Arch.<\/p>\n"},{"id":"1968","title":"","name":"jacob","url":"http:\/\/blog.fragdev.com","email":"jacob@fragdev.com","date":"20090906103215","text":"<p>I'm installing it on my Dell Mini 9, and the wireless card is a Broadcom 4312 Wireless Card.<\/p>\n<p>Just a bit tricky to get going without an internet connection - needed to download the package and transfer it via a USB drive.<\/p>\n"},{"id":"2075","title":"Re: Arch Nemesis","name":"tioduke","url":"","email":"tioduke@gmail.com","date":"20091004043120","text":"<p>How is it going?<\/p>\n"}]},{"id":"86","title":"Linux Outlaw Gaming","body":"<p>Fancy yourself a gamer? Fancy you'd like to be? Play a game once and a while? Well, we're looking for you!<\/p><p>Today, August 14th, we're trying to get some Linux gaming going under the Linux Outlaw banner. If you're interested, there's a simple way to join in: throw a <strong>LO<\/strong> in front of your name, and you're set!<\/p><p>I'm LO|Windigo, so if you run into me, introduce yourself. I'm always interested in meeting people who enjoy both Linux and gaming.<\/p><p>So, if you're interested in joining up with other outlaws, check out the <a href=\"http:\/\/linuxoutlaws.com\/forums\/viewtopic.php?f=2&amp;t=2020&amp;start=30\">\"Linux Outlaws gaming\" forum thread<\/a> or meet us in IRC. The more the merrier!<\/p>","date":"20090814075050","categories":["General","Linux"],"comments":[]},{"id":"85","title":"Troubleshooting: Scheduling Batch Scripts in Server 2003","body":"<p>For all of us stuck in a Windows Server environment, hopefully this will help a bit.<\/p><p>I encountered a problem running batch scripts as scheduled tasks in Windows Server 2003 under alternate credentials. I kept getting errors like the following:<\/p><p><code>Unable to start task.<br \/>The specific error is:<br \/>0x80070005: Access is denied.<\/code><\/p><p>It turns out that the reason this occurs isn't necessarily because of permission problems with the script itself, but with the Windows shell, <code>cmd.exe<\/code>. You see, the task scheduler isn't really running your batch script: it's running <code>cmd.exe<\/code>, with your script as an argument. So, you need to give read (maybe more?) permissions to the account that the service is running under, or else your script can't execute.<\/p><p>Yet another reason Linux is better as a server operating system...<\/p>","date":"20090716122209","categories":["Server","Security","troubleshooting"],"comments":[]},{"id":"84","title":"Rest and Relaxation","body":"<p>My Father's been lucky enough to secure some time at a small log cabin in the Adirondacks. If you need me, I'll be on <a href=\"http:\/\/maps.google.com\/?ie=UTF8&amp;ll=43.851396,-74.008809&amp;spn=0.021787,0.037422&amp;t=h&amp;z=15\">Balfour Lake<\/a> with most of the family.<\/p><p>Hopefully I'll have pictures when I get back!<\/p>","date":"20090624201418","categories":["General","Personal"],"comments":[{"id":"1715","title":"Oh hey!","name":"Ryan","url":"http:\/\/www.g33xnexus.com","email":"theycallmefish@gmail.com","date":"20090712194142","text":"<p>Oh hey Jake. I'm not sure if you remember me since we haven't talked in a while, but this is Ryan. I used to hang out with you and Gavin in some class in high school (its been so long that I've forgotten).<\/p>\n<p>Anyway, I was looking through my old buddy list and saw your old screenname. Somehow I remembered Wednesday Bubbles and got here. It would be great to catch up again. If you ever read this, email me sometime.<\/p>\n"}]},{"id":"83","title":"OutlawPla.net","body":"<p>Looks like the <a href=\"http:\/\/linuxoutlaws.com\">Linux Outlaws<\/a> have started up their own Planet: <a href=\"http:\/\/outlawpla.net\">OutlawPla.net<\/a>.<\/p><p>I'm a bit worried that some of my posts on this blog are a little off-topic, even for the Outlaws (folks coming from the <a href=\"http:\/\/linuxoutlaws.com\/forums\/\">Forums<\/a> will know what I mean). I'll be digging through the LifeType documentation to see if I can filter my RSS feed a bit, to prevent the FragDev-related news from hitting the planet site. If that isn't possible, I'll probably switch to manually updating the news and keep it off the blog. We'll see...<\/p>","date":"20090619074739","categories":["General","Linux"],"comments":[{"id":"1663","title":"Off topic is awesome!","name":"Fab","url":"http:\/\/lamerk.org","email":"fabsh@lamerk.org","date":"20090619130739","text":"<p>Ah don't worry, dude. No hassle! I'm sure it will be fine. :)<\/p>\n"},{"id":"1664","title":"that's the point","name":"jezra","url":"http:\/\/www.jezra.net","email":"jezra@jezra.net","date":"20090619134318","text":"<p>The point of the planet is to make a one stop shop for the blogs of forum members. If a blog is posted by a LO member, then the blog is on topic; regardless of the blog content.<\/p>\n"},{"id":"1665","title":"+1","name":"Fab","url":"http:\/\/lamerk.org","email":"fabsh@lamerk.org","date":"20090619184636","text":"<p>Jezra speaks the truth, as usual!<\/p>\n"}]},{"id":"82","title":"Lena's Adult Day Service","body":"<p>The first site hosted on the new server is up: make sure to take a look at <a href=\"http:\/\/lenasads.com\/\">Lena's Adult Day Services<\/a>!<\/p><p>If all goes well, I'm going to start moving the rest of the sites on there one by one. This should drop everyone's hosting costs by about 40% - 50%!<\/p>","date":"20090530131204","categories":["General"],"comments":[]},{"id":"81","title":"Arduino: Arrival","body":"<p>The Arduino, as described by <a href=\"http:\/\/www.arduino.cc\">the Arduino Homepage<\/a>, is \"an open-source electronics prototyping platform based on flexible, easy-to-use hardware and software.\" What that means to you may differ with your experience, but to me the Arduino is a little chunk of Italian-made circuit board that can make <abbr title=\"light emitting diode\">LED<\/abbr>s blink, can tell how bright the ambient light is, can run motors and mechanisms, and otherwise make electronic components do cool stuff.<\/p><p>There seems to be no limit to what people are capable of doing with one of these, with the addition of the right components. Just <a href=\"http:\/\/www.youtube.com\/results?search_type=&amp;search_query=Arduino\">search YouTube for Arduino<\/a> and you'll see what I mean. LED cubes dancing to music, robots that seek out the light &ndash; one of the guys from our <abbr title=\"Linux user group\">LUG<\/abbr> used his to have his dehumidifier tweet whenever it's full, and again to thank him for emptying it. If you would like to follow his dehumidifier, you can do so: <a href=\"http:\/\/twitter.com\/mwwdehumid\">Mark's Dehumidifier<\/a>.<\/p><p>So, as a step towards building my Linux-powered robot to satisfy a New Years resolution, I picked one up. I also bought a couple wires, LEDs and other random components to test with. It arrived yesterday, and pictures will follow (once I get my camera some batteries).<\/p><p>So far I haven't gotten too much accomplished. I've caused a single LED to blink on a schedule, and to react to the light level of the room using a photoresistor. I've also realized that I don't remember anything from Digital in high school &ndash; big suprise. Most of last night was spent looking up resistor color codes and re-learning the basics of electronics.<\/p><p>All things considered, I'm very optimistic about how it's going. I'll keep posting progress here for anyone that's interested!<\/p>","date":"20090530114635","categories":["Arduino"],"comments":[]},{"id":"80","title":"Issues with SQL Server 2005 and PHP - Part 1","body":"<p>This maddening issue took quite a while to figure out, so I sincerely hope I can save somebody the time by documenting it here.<\/p><p>First of all, here's the environment - at work, we're using the following:<\/p><ul><li>Windows Server 2003 w. IIS 6<\/li><li>PHP 5.2.9-1<\/li><li>MS SQL Server 2005 Express<\/li><li>Connection made using ODBC functions<\/li><\/ul><p>Yes, that's right, I have no control over most of the environment. Whatever. Moving on - we were having a problem with one of our new pages. Specifically, getting the information from the database and displaying it on the page.<\/p><p>Whenever I tried to run the query to get the database results, the script would consume all available memory immediately and halt the page execution. We're not talking the normal 8MB of RAM allocated to each page, either: we have our memory allocation bumped up to 128MB. Somehow this script consumed all 128MB and asked for more with just five result rows, each well under a couple kilobytes.<\/p><p>We were able to (somehow) deduce that the problem was in the table itself: apparently PHP's ODBC driver has a fit if there is a 'text' or 'ntext' field involved. It simply consumed all the memory and then quit.<\/p><p>Not a problem, though - MS recommends you stay away from those fields anyways, and instead use nvarchar(MAX) or varchar(MAX). A quick little switch, and we were on our way...<\/p><p>...to an even worse problem. Now, the same field that we had just modified was displaying - but not the text that field contained. Instead, it almost looked as if PHP was <strong>dumping memory<\/strong> into that field instead of the text itself. Inside of all the binary symbol garbage I saw things like function names, string values, and more. Extremely upsetting.<\/p><p>After a day and a half I figured out that the new nvarchar(MAX) data type seemed to be the cause, and switched it to the more bland (and not as scalable) nvarchar(1000). Still, if this had happened to one of our live pages, we could have had a serious security problem.<\/p><p>In conclusion, I will stay away from the following SQL Server data types as a sort of \"preventative best practice\":<\/p><ul><li>text or ntext<\/li><li>varchar(MAX) or nvarchar(MAX)<\/li><\/ul><p>If you have the option, I would recommend staying away from MS SQL Server all together. We have had no limit to the amount of problems this sub-par database has caused. Just use MySQL, PostgreSQL or one of the superior Free alternatives.<\/p>","date":"20090508112529","categories":["PHP","Server","SQL"],"comments":[]},{"id":"71","title":"Inserting Files as Binary Data in MS SQL 2005","body":"<p>I recently came upon an extremely quick, simple, and brutal to insert a file into a MS SQL database using only the query editor and a hex editor:<\/p><ol><li>Open the file in your hex editor<\/li><li>Select all the hex, and copy it<\/li><li>Open up the query editor<\/li><li>Type up your insert statement: <code>INSERT INTO table (binary_field) VALUES (0x!!!)<\/code><\/li><li>Replace the three exclamation points (!!!) by pasting the data you copied from your hex editor<\/li><\/ol><p>Now, this is far from recommended practice. In fact, this is a damn ugly way to do things. However, I didn't want to muck around in a scripting language, and the other SQL methods I found had too much SQL to them. SQL is not my strong suit, so <em>voila<\/em> &ndash; there you have it.<\/p>","date":"20090408165556","categories":["SQL"],"comments":[]},{"id":"70","title":"Class ... Not Found Issue","body":"<p>I ran into a very sticky issue while writing a very complex set of PHP classes: I continually ran into the \"Class '[ClassName]' not found\" error, even though the classes were clearly defined &ndash; sometimes even in the same file. This drove me nuts for hours.<\/p><p>I did some digging into the PHP class documentation, and it turns out that <strong>you <em>cannot<\/em> extend extended classes in PHP<\/strong>, and instead of giving you a helpful error message, it just says that the class cannot be found.<\/p><p>As an example, if you have a <code>BaseClass<\/code> class, and another class that's defined using <code>NewClass extends BaseClass<\/code>, you cannot then say <code>ExtendedNewClass extends NewClass<\/code>: that will throw a \"Class 'ExtendedNewClass' not found\" error.<\/p><p>I don't think I've found the bottom of this problem, so I'll continue adding any new information that I find.<\/p>","date":"20090304123246","categories":["PHP"],"comments":[]},{"id":"69","title":"New Layout","body":"<p>This weekend I've been able to dedicate some time to revamping the Fragmented Development web site &ndash; which really needed it. The layout that has been up since 2005 has served me well, but this one will be much easier to manage.<\/p><p>Also, it is less offensively orange.<\/p><p>I've updated the navigation bar to include some of the new pages, one of which is the blog, which has languished in obscurity for far too long!<\/p><p>More to come...<\/p>","date":"20090125090416","categories":["General"],"comments":[]},{"id":"68","title":"Troubleshooting: PHP Extended Classes","body":"<p>This is really just a quick piece of trivia, but can cause tremendous problems if you're not expecting it.<\/p><p>PHP does not, by default, call the parent class' constructor when you create an instance of an extended class.<\/p><p>If you would like to have this happen, you must add a manual call to the parent constructor, like so: <code>parent::__construct();<\/code>.<\/p><p>This caused some very random issues in some of my layout templates, so hopefully I've saved you the trouble of tracking them down. Enjoy!<\/p>","date":"20090109120532","categories":["PHP"],"comments":[{"id":"1952","title":"ss","name":"fsd","url":"","email":"","date":"20090903194526","text":"<p>sfd<\/p>\n"}]},{"id":"67","title":"Troubleshooting: Right Alt Key in Ubuntu 8.10","body":"<p>After recently taking a trip down memory lane with the old DOS-based <a href=\"http:\/\/www.idsoftware.com\/\">Id<\/a> game, <a href=\"http:\/\/en.wikipedia.org\/wiki\/Hexen\">Hexen<\/a>, under <a href=\"http:\/\/www.winehq.org\/\">Wine<\/a>. I discovered a very random issue with my installation of Ubuntu 8.10 (Intrepid Ibex): my right alt key didn't really do anything.<\/p><p>I guess I had never used it previously, but in Hexen, alt just happens to be the \"strafe\" key. This made it extremely difficult to stay alive, which motivated me to find a fix.<\/p><p>It turns out that it's actually a problem with the keyboard layout that was detected automatically. Easily remedied by doing the following:<\/p><ul><li>Click on the \"System\" menu<\/li><li>Select \"Preferences\"<\/li><li>Open the \"Keyboard\" preferences<\/li><li>Choose the \"Layouts\" tab<\/li><li>Select the one you're using - Mine was set to USA automatically<\/li><li>Click the \"Other Options\" button<\/li><li>Expand the \"Alt\/Win key behavior\" category<\/li><li>Select the \"Alt and Meta are on the Alt keys\" option<\/li><\/ul><p>Pretty obscure, and I'm not sure what other side effects it may have, but it did the trick for my particular keyboard\/layout combination; I'm using a Kensington K64362 Standard Keyboard with the USA layout.<\/p><p>Hope this helps somebody out there!<\/p>","date":"20090101005037","categories":["Linux"],"comments":[{"id":"3715","title":"","name":"replica watches","url":"http:\/\/www.replicame.com\/rolex-watches.html","email":"uoyaov@dool.com","date":"20100518145424","text":"<p>l used for the manufacturing of the case is oxidized steel from Titanic which adds to the watchs value and it gives a chic appearanceThe strap of the new Romain Jerome Cabestan Titanic DNA Tourbillon watch matches perfectly the oxidized steel case on a light brown color recreating an old <a href=\"http:\/\/www.replicame.com\/rolex-day_date-watches.html\" rel=\"nofollow\">rolex day date<\/a>  <a href=\"http:\/\/www.replicame.com\/breitling-watches.html\" rel=\"nofollow\">fake breitling watches<\/a>  rusty look This watch is definitely appropriate for those who are dissatisfied with the standard watch designs and the oldfashion appearances <a href=\"http:\/\/www.replicame.com\/cartier-lanieres-watches.html\" rel=\"nofollow\">cartier lanieres<\/a>  <a href=\"http:\/\/www.replicame.com\/bell_ross-watches.html\" rel=\"nofollow\">bell ross<\/a>  <a href=\"http:\/\/www.replicame.com\/breitling-emergency_mission-watches.html\" rel=\"nofollow\">breitling emergency mission<\/a>  <a href=\"http:\/\/www.replicame.com\/rolex-watches.html\" rel=\"nofollow\">watches<\/a> The creative vision of TechnoMarine is reflected in every unconventional watch ever designed by the brand and in every revolutionary technical mechanism ever produced <a href=\"http:\/\/www.replicame.com\/omega-watches.html\" rel=\"nofollow\">omega replica<\/a>  <a href=\"http:\/\/www.replicame.com\/concord-cheap-watches.html\" rel=\"nofollow\">replica concord cheap watches<\/a>  Believing strongly in<\/p>\n"}]},{"id":"66","title":"Browsers Don't Matter","body":"<p>Web development is entirely reliant on browsers to display web sites. Without browsers, the large majority of the Internet would cease to be useful &ndash; or functional for that matter. So how is it that browsers don't matter?<\/p><p>Each browser has at it's core a layout engine, and this layout engine actually determines what the page displays. While we have dozens of browsers to accommodate, most of them share layout engines. Safari, Konqueror, and Chrome all use <a href=\"http:\/\/en.wikipedia.org\/wiki\/Webkit\">Webkit<\/a> (originally <a href=\"http:\/\/en.wikipedia.org\/wiki\/Khtml\">KTHML<\/a>); Firefox, Camino, and SeaMonkey are all <a href=\"http:\/\/en.wikipedia.org\/wiki\/Gecko_(layout_engine)\">Gecko<\/a> browsers.<\/p><p>The majority of the layout engines render content according to the <a href=\"http:\/\/www.w3.org\/\">W3<\/a> standards, and should render your page in a similar fashion. There are very few browser-specific bugs these days, and most of them are pretty obscure.<\/p><p>They have a saying about generalizations, and this one is no exception. Out of all the layout engines, one still remains a thorn in the side of most developers: <a href=\"http:\/\/en.wikipedia.org\/wiki\/Trident_(layout_engine)\">Trident<\/a>, the layout engine of Internet Explorer, in use since IE4. I'm not sure if they've actually beaten Trident into shape for IE8 or created a new engine, but it doesn't behave like old Trident. In fact, Trident doesn't always behave like Trident, depending on what version of Internet Explorer you're testing. Each version has their own bugs, some of them show-stoppers, like IE6 's problem with fixed positioning and lack of alpha channel support in PNG images.<\/p><p>Even without IE8, the development landscape is much better than what it was years ago. Instead of checking your page against every major browser available, you can develop a standards-compliant page and make sure it displays correctly in a Webkit-based browser and a Gecko-based browser. Sure, you still have to run it by every version of IE in use, but we're one step closer to forgetting the pain of browser inconsistencies and CSS hacks.<\/p>","date":"20081229091314","categories":["CSS","HTML","Browser"],"comments":[]},{"id":"65","title":"Manipulating Files Without the Filesystem Functions","body":"<p><a href=\"http:\/\/www.godaddy.com\">GoDaddy<\/a> doesn't allow sites to write files to the filesystem using the PHP <a href=\"http:\/\/www.php.net\/manual\/en\/book.filesystem.php\">filesystem functions<\/a>. This may be due to security concerns, but it put a kink in the comic system. Storing strip images could always be done through the database, but that adds a whole extra layer of complexity and performance drain to the application. <\/p><p>To get around these drawbacks, I ended up using the <a href=\"http:\/\/us3.php.net\/manual\/en\/book.ftp.php\">FTP extension<\/a> to bypass the Filesystem extensions entirely. GoDaddy allows you to upload your files through FTP, so I created a second account for the site itself to use and funneled all of the files through the FTP functions. I abstracted as much of this as possible, so that if we ever regain the use of the filesystem functions I can switch to those without much hassle.<\/p><p>This method worked incredibly well, considering it was originally meant as a workaround. FTP provides almost all of the basic functionality of the filesystem functions, but it does require the extra overhead of managing a connection and requiring a username and password. I would be interested in seeing if there was any performance cost involved with running through the extra layer of abstraction.<\/p><p>One glaring issue came up while using the FTP functions in place of the filesystem functions: temporary files. The FTP functions (at least in PHP 4) did not really provide a mechanism for creating and working with <a href=\"http:\/\/www.php.net\/manual\/en\/function.tmpfile.php\">temporary files<\/a>. Uploading a file through a form worked flawlessly, and I could manage files that already existed in the filesystem, but creating a new file and then saving it somewhere wasn't really possible. This really interfered with some cool CSS tricks I had planned, and I honestly haven't really figured out a workaround for it just yet.<\/p><p>Again, as someone who manages a server, I can very well see this being a security issue. While I empathize, I also wish there was some way to provide this functionality. If PHP 5 was available, I believe I could have gotten by with some of the newer FTP functionality.<\/p><p>Anyways, if I can get it together to gather the FTP workarounds I came up with into a file that can be included, I may post it here later. Maybe it will be useful to someone?<\/p>","date":"20081216131610","categories":["PHP"],"comments":[]},{"id":"64","title":"Lessons Learned","body":"<p>I haven't posted in quite a while; I've been working on a side project for a couple friends that will manage their new web comic. Feel free to check out the <a href=\"http:\/\/valcielle.fragdev.com\">Val'Cielle web comic<\/a> for yourself.<\/p><p>As with any project like this, I learned some valuable lessons about PHP and techniques for getting things accomplished. I'll be posting these to try to get back into my regular schedule, and hopefully put out some tricks you can use yourself.<\/p>","date":"20081201213350","categories":["General"],"comments":[]},{"id":"62","title":"Javascript for Layout","body":"<p>I browse with an Firefox extension called <a href=\"http:\/\/noscript.net\">NoScript<\/a>, because it's one of the only ways to secure yourself against most of the nasty things that lurk on the internet. Right now, it's almost a silver bullet for web security: it is rather hard to automatically compromise someone's PC without javascript. If you're at all concerned about identity theft or keeping your computer clean, then this extension is for you.<\/p><p>Lately, I've seen a rash of pages that react very strangely in my browser, simply because I have Javascript disabled. Half the styles will dissappear or not be applied at all, the layout will be severely altered, links and navigation are completely broken, etc.<\/p><p>Take <a href=\"http:\/\/www.fedex.com\">FedEx.com<\/a> for example. With Javascript enabled, you get a reasonably standard web site layout. The navigation, which uses simple drop-down menus, is positioned at the top.<\/p><p class=\"center\"><img src=\"imgs\/fedex.jpg\" alt=\"A side-by-side comparison of the fedex web site, with and without javascript enabled\" \/><\/p><p>However, when you disable javascript, the menus end up reverting to their obvious unordered list heritage, and overlap themselves quite a bit. Still \"useable\", but it also pushes the rest of the site off of the first page. You have to scroll down before you can see the rest.<\/p><p>If these items required javascript, then that would be one thing. I can quite understand when an application like <a href=\"http:\/\/maps.google.com\">Google Maps<\/a> doesn't work without Javascript or Flash. If possible, I think it's reasonable to degrade gracefully, but that's a topic for another time. <strong>Simple drop-down menus do not require javascript<\/strong> and shouldn't use them. It complicates the code behind the page, and slows down the functionality for the client - Javascript is several orders of magnitude slower than <abbr title=\"cascading style sheets\">CSS<\/abbr>.<\/p><p><a href=\"http:\/\/www.xanga.com\">Xanga<\/a> is also guilty of this abuse of Javascript. The login box on their main page, a <em>simple <abbr title=\"hypertext markup language\">HTML<\/abbr> form<\/em>, now requires javascript to submit. A simple HTML submit button can serve the same purpose, yet they feel my browser should have to interpret their client-side scripts every time I log in. I cannot express how irritating this is, and it may cause me to stop using their service.<\/p><p>Please, folks, let's code responsibly. <strong>Don't require Javascript to use your page unless it's absolutely necessary<\/strong>. Due to it's malicious possibilities, more and more people will be turning it off in the future. Build your sites so that Javascript isn't a required component, and everyone wins.<\/p>","date":"20080809133157","categories":["Javascript"],"comments":[{"id":"1668","title":"Google maps","name":"Dennis","url":"","email":"","date":"20090621013253","text":"<p>Google maps actually works without javascript too :)<\/p>\n"}]},{"id":"61","title":"Regex Renegade","body":"<p>Being a web guy in a small government organization, I have limited ammounts of time to put towards each page. The ammount of time I put into a page directly effects how practical it is to create that page; it also effects how much time I have for the next page. The time I take to put up one page has a kind of cascade effect on how much the County can put online. With that taken under consideration, I do not take lightly any technique that saves me time. <a href=\"http:\/\/www.pspad.com\">PsPad<\/a>, my text editor, has earned a warm place in my heart because of just that: it's full of little time-saving functions that make my life easier.<\/p><p>One of these time-saving functions is an advanced search and replace feature that uses <a href=\"http:\/\/www.regular-expressions.info\/\">regular expressions<\/a> (or regex for short). RexEx serves a very specific purpose: it matches patterns in text. Using search and replace with RegEx can make HTML extremely short work, and allow you to convert huge documents into HTML with a couple finely-tuned regular expressions. Who knows, perhaps using this ultra search and replace could even <a href=\"http:\/\/xkcd.com\/208\/\">save the day<\/a>?<\/p><p>This is one way to speed yourself up as a web guy, without growing extra arms or sacrificing sleep. I think I'll post a couple more of these \"productivity boosts\" a bit later, and hopefully it will help someone out there keep up.<\/p>","date":"20080803123858","categories":["HTML"],"comments":[]},{"id":"60","title":"Configure Under Fire","body":"<p>Due to some inescapable conditions we've encountered at our hosting provider at work, we have been cornered into hosting it ourselves. This doesn't bother me one bit, but I wish we weren't trying to do it <em>yesterday<\/em>.<\/p><p>So, here I am, in the basement, configuring an IIS web server to host multiple virtual sites where once it hosted only one. Not only that, but now we're supporting an additional scripting language (<a href=\"http:\/\/www.adobe.com\/products\/coldfusion\/\">ColdFusion<\/a>, the rat bastards) in addition to our current <a href=\"http:\/\/www.asp.net\/\">ASP.NET<\/a> and <a href=\"http:\/\/www.php.net\">PHP<\/a> offering. As you can imagine, <strong>I'm going to run into lots of problems.<\/strong> I'm going to document them here, so that if there's anyone else stuck in this situation (like me in the future), this might help them along.<\/p><h3>Problem 1: \"No input file specified\" with PHP<\/h3><p>I ran into this problem when I tried to change the <code>doc_root<\/code> value in the <code>php.ini<\/code> file. Initially, it was set to the web root folder of the main site, because there wasn't anything else. When I tried to move it up one level, I encountered the \"No input file specified\" error message.<\/p><p>This is probably fixable somehow, but I just commented out the <code>doc_root<\/code> directive. Works like a charm, no fuss. While this may decrease security some, IIS should enforce directory traversal restrictions. Or so I assume. Or hope, whichever you like. Anyways, cross it off the list!<\/p><h3>Problem 2: Connect ColdFusion to a MS SQL Server Express 2005<\/h3><p>Since we're a public entity, and because I don't want to pay for the piece of crap that Microsoft's SQL server is, we use MS SQL Server Express 2005 (Extended enterprise deluxe network edition SP3 MMX ...) as our back-end database. Eventually I will convince my boss that a crippled piece of crap software like MS SQL Server Express is not the way to go, and that we should switch to something robust and full-featured like MySQL, PostgreSQL, or anything else really.<\/p><p>Oh yeah, here's how to connect: <a href=\"http:\/\/www.fusioncube.net\/index.php\/coldfusion-sql-server-express\">http:\/\/www.fusioncube.net\/index.php\/coldfusion-sql-server-express<\/a>. Written for CF7, works for CF8. Make sure to use your server's IP address as the connection string in the ColdFusion settings, not the SERVER\/INSTANCE form.<\/p><h3>Problem 3: MS SQL Server Development Studio doesn't carry over the \"Identity\/autonumber\" attribute when importing data<\/h3><p>Yes, that's right. They don't. I had to enable them manually, which isn't difficult, but takes frickin' forever. Microsoft, get your act together.<\/p>","date":"20080712092053","categories":["Content"],"comments":[]},{"id":"58","title":"Mind Your Versions","body":"<p>This blog, <a href=\"http:\/\/www.fragdev.com\">the main site<\/a>, and many of my other sites are hosted by the \"colorful\" web host <a href=\"http:\/\/www.godaddy.com\">GoDaddy<\/a>. I use them for several reasons, like reliability (100% uptime on their Linux servers) and their reasonable price. In fact, I have been an extremely happy customer &ndash; almost a fanboy &ndash; but I have run across a dilemma.<\/p><p>GoDaddy, for some reason, has stuck hard with <abbr title=\"PHP Hypertext Pre-processor\">PHP<\/abbr> 4. When I became involved in PHP programming, PHP 5 was still brand new, shiny, and untested. At that time, I would have understood if they chose to stick with PHP 4, because it was the reliable language and PHP 5 was still a tad experimental. But right now, half a decade since I started developing with PHP, version 4 has seen it's last update. We'll be dealing with PHP 6 soon, and it's extremely hard to go backwards. The transition between versions has been such a sea change that you almost need to develop parallel versions of your scripts to offer backwards compatibility.<\/p><p>This is a very specific problem, so I'm going to make an analogy: developing for PHP 4 would be like, in my opinion, running Windows 95 now. Sure, you may be able to do most everything in the old version, but it's like riding your bike backwards and upside down. Possible, but annoying as hell.<\/p><p>To their credit, GoDaddy is planning an upgrade to their platform and I've opted-in to it. However, I'm not sure I can wait for them to catch up. So... do I leave my beloved reliable host or do I stick around and wait?<\/p><p>For now, I'm brushing up on my PHP 4. We'll see how long that flies.<\/p>","date":"20080608214734","categories":["PHP","Server"],"comments":[]},{"id":"57","title":"Safeguard Your Redirects","body":"<p>Every once and a while, I allow a page to terminate itself by redirecting the user to another page with the <code>header()<\/code> function. This effectively stops script execution, because the user is sent to another page, right?<\/p><p>Not always.<\/p><p>If output has been sent to the user ahead of the the <code>header()<\/code> call, nothing happens. PHP cannot modify headers after output has been sent to the user, so your redirect falls flat. You have two ways to remedy this situation (you can use both if you'd like):<\/p><ol><li><strong>Enable output buffering:<\/strong> I haven't tried this one myself, so make sure to verify it works.<\/li><li>Explicitly force the script to stop processing using the <code>exit()<\/code> function<\/li><\/ol><p>I'm fond of calling <code>exit()<\/code>, because it stops a script dead in it's tracks without any fuss. If you explicitly tell PHP to quit processing, then there's nothing further to worry about.<\/p>","date":"20080515124727","categories":["PHP"],"comments":[{"id":"885","title":"","name":"online petition","url":"http:\/\/www.petitionspot.com\/","email":"","date":"20080830225449","text":"<p>this is how my wp blog recently got exploited<\/p>\n"}]},{"id":"56","title":"A-oK","body":"<p><strong>Note:<\/strong> Update at the bottom of this post.<\/p><p>After feeling the age of my current PC, I decided it was time for a new build. I built the last couple PCs I've owned, either from salvage or from scrap, and I didn't see any problem with continutng the tradition. After four packages and a couple hours of assembly time, it was complete: my masterful new PC. All that remained was to install the latest version of Kubuntu (8.04 at the time), which was conveniently released that day.<\/p><p>This was a colossal mistake.<\/p><p>I've built half a dozen machines, and more often than not I run into a problem doing so. Something might have been damaged during shipping, the specifications had changed while I wasn't looking - it doesn't matter what it was, but something usually goes wrong. It's part of the territory. You deal with it, and you move on.<\/p><p>The same thing can be said for installing\/upgrading to new operating systems, especially Linux flavors. Something usually goes wrong, whether it's a kernel bug or a hardware incompatibility. It's usually best to wait it out, and let the early adopters iron out the bugs.<\/p><p>Apparently, this time around I'm going to have to iron out the bugs. Kubuntu installed, but only after switching to the alternate installation disk. The desktop version kept stalling at the partitioning phase. But with the alternate disk, I was presented with a working system that continued to work until I did something <em>\"hard\".<\/em> If I somehow used the processor or memory too much, the system froze solid and eventually had to be manually powered off.<\/p><p>At first, I thought this was a hardware issue. I tried to revert to the previous version of Kubuntu, 7.10, but that wouldn't work correctly with the new video card I was using. As a last resort, I put in Windows XP... which worked after I applied all of the 3rd party motherboard and graphics drivers. I had that ol' sinking feeling... to use my new fancy computer, I was going to have to use Windows.<\/p><p>I have two separate hard-drives in the new system, so the idea was that I would install Windows on the system drive, and keep the data partition formatted in Ext3. I could use the <a href=\"http:\/\/www.fs-driver.org\/\">Ext3 driver for Windows<\/a> until Linux supported my hardware, and then simply format the system drive and install Linux.<\/p><p>So, to format the data partition with Ext3, I decided to install Ubuntu. I'm definitely a KDE guy, but the KDE4 stuff doesn't really do anything for me. I try to take a look at Gnome every once and a while, just to keep up-to-date on it, and thought this would be a great way to do it. Install Ubuntu, fart around a little to get the lay of the land, and then install Windows again when it crashes.<\/p><p>Except it didn't crash. For some unknown reason, Ubuntu is just as stable as can be. I've been working for hours, stressing the system, and it's been fine. I won't have to resort to Windows, but I am somewhat forced into giving Gnome a try. Maybe it's fate (or maybe the <a href=\"http:\/\/www.lugradio.org\/\">LUGradio<\/a> guys have finally found a way to bring down KDE...)<\/p><p><strong>Update:<\/strong> Ubuntu has also had a nasty habit of restarting the window manager on me every once and a while, completely kicking me out of whatever I'm doing at the time. It looks like, for now, I'll have to run Windows XP on the new PC, and stick to Ubuntu on the old machine for all my work. Now, to try reporting my hardware to the appropriate people...<\/p>","date":"20080503222144","categories":["Linux"],"comments":[]},{"id":"55","title":"Debugging the \"Object has no properties\" Error in Javascript","body":"<p>I've encountered this problem before while writing Javascript, and was recently reminded what a pain it can be to debug. Hopefully these tips will prevent you some strife in your own coding.<\/p><h3>Anatomy of the Error<\/h3><p>This error occurs when you try and access an object's property, usually with dot notation, when the object does not exist or does not exist <em>yet<\/em>. For instance, accessing the \"status\" property of the \"window\" object looks like this:<\/p><p><code>var status = <strong>window.status<\/strong>;<\/code><\/p><p>The problem occurs if the object (in this case, <code>window<\/code>) doesn't exist for some reason. There are several reasons this might occur.<\/p><h3>Mis-spelling<\/h3><p>Are you sure you're talking about the right object? If you're trying to write the example above, but accidentally enter the following code...<\/p><p><code>var status = <strong>widnow<\/strong>.status;<\/code><\/p><p>...then the browser is going to be unable to find that \"widnow\" object and will throw that error as a result. Instead of the <code>window<\/code> object, it thinks you're referencing the <code>widnow<\/code> variable, which is initialized as <code>NULL<\/code> and doesn't have a <code>status<\/code> property.<\/p><h3>Page Has Not Loaded<\/h3><p>Browsers implement something called \"progressive rendering\", which means they'll try and display the page as fast as they get it, line by line. If you include your javascript in the <code>head<\/code> tag, then that code will be run before the browser has a chance to load the body.<\/p><p>If you don't reference any elements specifically, you might be able to get away with this &ndash; but you're better off playing it save and having everything run after the page has loaded. Stick all of your scripts in a function or object, and tell them to execute after the page is done loading using something like <a href=\"http:\/\/www.dustindiaz.com\/rock-solid-addevent\/\">Dustin Diaz's <code>addEvent()<\/code> function<\/a>.<\/p><h3>Sneaky Bugs<\/h3><p>The bug that got me thinking of all of this was a sneaky one. I had my code wrapped in a function called <code>closeWindow()<\/code>, that was added at the time of page load using the <code>addEvent()<\/code> function:<\/p><p><code>addEvent(window, 'load', closeWindow());<\/code><\/p><p>Each time I refreshed the page, I received the \"object has no properties\" error message. I debugged a little bit, and was able to figure out that the contents of the <code>closeWindow()<\/code> function was being executed <em>before<\/em> the page was loaded, even though I went to all the trouble of using the <code>addEvent()<\/code> function.<\/p><p>The culprit was the extra set of parentheses I added to the <code>addEvent()<\/code> argument. When you send a function into <code>addEvent()<\/code> (or any other function, I suppose) as a function argument, <strong>do not add parentheses after the function name!<\/strong> Instead of sending the name of that function, I was executing the function as soon as I called <code>addEvent()<\/code>, before the page had to load. Here's the revised code, that worked like a charm.<\/p><p><code>addEvent(window, 'load', closeWindow);<\/code><\/p><hr \/><p>I hope this saves some time debugging a similar problem. If you find this useful, let me know!<\/p>","date":"20080424160802","categories":["Javascript"],"comments":[{"id":"4285","title":"","name":"replica watches","url":"http:\/\/www.seawatches.com","email":"uoyaou@vool.com","date":"20100519201709","text":"<p>de Narp previously served as President and CEO of Cartier North America He succeeds Tom ONeill who led Harry Winston Inc over the last 5 years Mr <a href=\"http:\/\/www.seawatches.com\/tudor-prince_date-watches.html\" rel=\"nofollow\">Replica TUDOR PRINCE DATE Watches<\/a>  <a href=\"http:\/\/www.seawatches.com\/rolex-watches.html\" rel=\"nofollow\">rolex<\/a>  de Narp joined Cartier in 1991 <a href=\"http:\/\/www.seawatches.com\/tag_heuer-tag_heuer_slr-watches.html\" rel=\"nofollow\">TAG HEUER SLR<\/a>  and was named president and CEO of Cartier North America in 200Mr de Narps career in luxury retail began 18 years ago at Cartier in Japan Over the course of almost 20 years <a href=\"http:\/\/www.seawatches.com\/invicta-watches.html\" rel=\"nofollow\">fake invicta<\/a>  his climb through the executive ranks at Cartier took him to Tokyo Switzerland Italy and Greece <a href=\"http:\/\/www.seawatches.com\/breitling-watches.html\" rel=\"nofollow\">breitling watches<\/a>  and in 2005 he moved to New York to oversee Cartier North AmericaHarry Winston Chairman and CEO Robert Gannicott said We are delighted that Frederic will be joining Harry Winston <a href=\"http:\/\/www.seawatches.com\/bvlgari-ergon-watches.html\" rel=\"nofollow\">Replica BVLGARI ERGON Watches<\/a>  Inc <a href=\"http:\/\/www.seawatches.com\/tag_heuer-watches.html\" rel=\"nofollow\">replica tag heuer<\/a>  He has an innate ability for understanding the luxury consumers needs in the United States and globally Frederic brings high energy as well as a clear vision of the relevance of luxury and jewelry to the modern world His industry expertise combined with our companys unrivalled position in the market will play an integral role in the development and growth of the Harry Winston business and brand internationally <a href=\"http:\/\/www.seawatches.com\/tudor-watches.html\" rel=\"nofollow\">TUDOR<\/a><\/p>\n"}]},{"id":"54","title":"Information Overload","body":"<p>I've recently been reading the planets: <a href=\"http:\/\/planet.ubuntu.com\/\">Planet Ubuntu<\/a> and <a href=\"http:\/\/planet-websecurity.org\/\">Planet Web Security<\/a>, in addition to my daily blogs. Planets are really just lots of blogs tied together into one RSS feed, so in essence I just started reading forty more blogs in two additional subscriptions.<\/p><p>In addition to that, I've been reading more ordinary blogs. I really like subscribing via <abbr title=\"Really Simple Syndication\">RSS<\/abbr> feed, and having interesting information delivered to me on a regular basis. On average, I'd say I read about thirty posts a day, of varying lengths, depending on the blogger. This is a nice, steady stream of information &ndash;  not too much, not too little &ndash; until you miss a day. Thirty doubles and becomes sixty, which is way too much information for one sitting. Imagine if I miss more than one day?<\/p><p>While this daily deluge of information is keeping me up to date, and I'm learning more than ever before, it is also quite daunting to manage. I've found that sometimes a busy day on Planet Ubuntu can make me late for work if I spend too much time on reading. The more I read at work, the less time I have to devote to actual work. To balance things out, I've created a few rules I follow when keeping up on the blogosphere:<\/p><h3>It will be there tomorrow.<\/h3><p>Since I use an RSS reader, I have no reason to rush through todays blog posts. They'll still be there tomorrow, and the day after that, and the day after that if I really need them to. Letting your daily reading impact the rest of your day is nonsense.<\/p><p>If you're really behind, try and read a little out of your daily routine. I usually read just in the mornings, so if I'm drowning in information, I read a couple posts when I get home from work or before I punch out.<\/p><h3>Read It Later<\/h3><p>If there's a thirty page long blog entry, and it seems awfully good, mark it for later and move on. Odds are that you'll have some free time to kill someday, and that will be great for reading that epic entry on interface design, or how to configure a streaming media server using open source software.<\/p><p>If you try to cram how-tos and in depth articles into your daily reading, you won't get anything out of them. Information that requires that level of involvement is better left for later reading, or applied to a project when it's needed. Most RSS aggregators have the ability to tag items as  &ldquo;ToDo &rdquo; or  &ldquo;Later &rdquo;. Take advantage of that, and put if off until you can really benefit from it.<\/p><h3>Skim The Planets<\/h3><p>One thing I've encountered continuously on the planets I read is that some posts are not aimed at me at all. Whether it's a technical comparison of different methods of managing packaging repositories in Linux, or new heuristics for penetration testing web applications using Javascript and the DOM... I couldn't possibly be less interested. These are posts with extremely specialized information, none of which will ever be useful (or understandable, for that matter) in the foreseeable future.<\/p><p>I know it sounds cruel, and I know it's hard to do occasionally, but you need to delete these posts. Don't read them, don't look at them, just get rid of them. If the title of the post involves a function, program, technique or language you don't use and have no interest in, odds are you're not going to gain anything out of the post itself. As a blogger, I don't mind if the knitting community never gets into this blog &ndash; they're not who I'm targeting with my writing. I'm sure the penetration testers, packagers, and kernel hackers out there don't care that I'm not reading their latest tips and tricks.<\/p><hr \/><p>Hopefully these techniques will help you keep your head above water, and stop you from becoming overwhelmed when dealing with all of the information available to us as part of the net. We're stuck forever keeping up-to-date, but you don't need to let current events take over your life.<\/p>","date":"20080419085858","categories":["General","Linux","Security"],"comments":[{"id":"3713","title":"","name":"replica watches","url":"http:\/\/www.replicame.com\/rolex-watches.html","email":"uoyaov@dool.com","date":"20100518145234","text":"<p>atches the Arabic numerals indications provided on the incorporated stainless steel bezel The dial of the new Tudor Speed Iconaut watch features three other subdials <a href=\"http:\/\/www.replicame.com\/cartier-cpcp-watches.html\" rel=\"nofollow\">replica cartier cpcp watches<\/a>  traditional Replica Watcheshands for hour <a href=\"http:\/\/www.replicame.com\/breitling-watches.html\" rel=\"nofollow\">breitling watches<\/a>  minute and second and a date window located at 4 oclock The choice of colors from this watch is interesting the designers managing to combine silvery black and grey into creating a remarkably tasteful piece <a href=\"http:\/\/www.replicame.com\/a_lange_sohne-cheap-watches.html\" rel=\"nofollow\">replica a lange sohne cheap watches<\/a>  The functions of the sub <a href=\"http:\/\/www.replicame.com\/omega-watches.html\" rel=\"nofollow\">omega replica<\/a> dials are easily set and controlled with the help of the lateral pushers from the lateral side of the case Regarding its technical performance its important to know that the new Tudor Speed Iconaut watch uses a selfwinding mechanical movement <a href=\"http:\/\/www.replicame.com\/hublot-watches.html\" rel=\"nofollow\">replica hublot watches<\/a>  which generates a generous water resistance of 150 metersThe other model included in the Speed Collection goes by the name of Tudor Speed Chronograph Watch and compared to its fellow brother this watch seems to approach a more elegant and chic appearance <a href=\"http:\/\/www.replicame.com\/breitling-colt-watches.html\" rel=\"nofollow\">breitling colt<\/a>  The sporty look is still maintained but the choi <a href=\"http:\/\/www.replicame.com\/rolex-watches.html\" rel=\"nofollow\">replica rolex<\/a>  <a href=\"http:\/\/www.replicame.com\/alain_silberstein-watches.html\" rel=\"nofollow\">alain silberstein<\/a><\/p>\n"}]},{"id":"53","title":"Making Navigation Work","body":"<p>Out of all the projects I've been working on, one issue continually crops up. That issue is site navigation, and it is the single most important part of your site.<\/p><p>I'm not mincing words here, because there is nothing, <strong>nothing<\/strong> more important than your site's navigation. You can have the greatest site on the entire planet, with the richest content and the most to offer to your visitors, and if they can't get to it then you're sunk.<\/p><p>One of the common fallacies of site navigation is organizing your site based on the hierarchy you see. We have an example of this at Warren County &ndash; we started life with a single, alphabetical list of departments as our site navigation. It made sense to us, because Health Services kept up the Health Services site, and the County Clerk kept up the County Clerk site. The essence of simplicity, right?<\/p><ul><li>Warren County<ul><li>County Clerk<ul><li>DMV<\/li><li>Passports<\/li><li>Pistol Permits<\/li><\/ul><\/li><li>Health Services<ul><li>Rabies Clinics<\/li><li>Public Health<\/li><li>Homecare<\/li><\/ul><\/li><\/ul><\/li><\/ul><p>Well, yes, that works wonderfully &ndash; for us. For the rest of the world that would actually be using our site, this didn't help them one bit. Only the department name was shown on the homepage, so if they were looking for a passport application, they needed to know beforehand that the County Clerk takes care of passports, and then logically that web site would hold the application.<\/p><p>You need to take a look from outside, and see what your visitors see. Instead of being a county employee, I had to take the point of view of a citizen who didn't know anything about the workings of county government. We began by creating four general categories of \"stuff\" that we have in the county: citizens, visitors, business, and government. It's really just a loose arrangement: there are citizens interested in business, visitors interested in business, and everything on the county web site is technically about county government, but you get the idea. Then, we took the pages of each departmental site and sorted them into one of these categories. So instead of first seeing a listing of department names, they'd see the a list of things for citizens to do.<\/p><ul><li>For Citizens<ul><li>DMV<\/li><li>Homecare<\/li><li>Passports<\/li><li>Pistol Permits<\/li><li>Rabies Clinic<\/li><\/ul><\/li><\/ul><p>This allowed them to get where they were going in one click. We're still halfway there at the county: for right now, we still have the departmental listing, and only show the top five or ten links from each of the categories. But the important thing is that it's a start, and we can gradually move to a more logical navigation scheme.<\/p><p>This all would have been much easier if we had designed everything this way from the onset. The important thing to remember is to put yourself in your visitor's shoes, and then make decisions from there.<\/p>","date":"20080315112206","categories":["Content"],"comments":[]},{"id":"52","title":"Design and Standards","body":"<p>One of the things I've been doing as of late involves subscribing to the <abbr title=\"really simple syndication\">RSS<\/abbr> feed of any sites I find in my travels - that is, any feeds I think might provide insight or intelligence. One of the sites I've stumbled upon is <a href=\"http:\/\/www.designmeltdown.com\/\">Design Meltdown<\/a>, a design-heavy web site that showcases good design by category (colors, design techniques, genres of page, etc). I'm trying to improve my design skills, so this gives me some creative fat to chew.<\/p><p>Another thing it's given me is a cross-selection of the good graphical designs on the web. This usually includes a lot of extremely bad technical choices: flash-only sites, monster downloads, table layouts, and more overly image-based sites than you can shake a stick at. Now I understand that some design schools incorporate being a prick about micro-managing your type into every site design class, but seriously. The content of your site does not need every word, every line properly kerned. <strong>Leave the text content rendering to the browser\/OS and the user.<\/strong> I might like to read in 32 pt Courier, and who are you to tell me otherwise? Locking me into your artistic vision takes away my right to view content how I please, and at that point that's not a web site &ndash; that's you, gratifying yourself, in my web browser.<\/p><p>But I digress. While I've seen a lot of crappy web sites that just happen to look beautiful (If you're using a major browser, on broadband, with all plugins enabled, with 20\/20 vision), I've also seen a tremendous rise in the presence of extremely well programmed, standardized sites. Not only have these sites incorporated stunning visuals and excellent design techniques common to sites created by people who have a background in art, but the code has obviously been put together by someone that is extremely proficient with standardized <abbr title=\"cascading style sheets\">CSS<\/abbr> and <abbr title=\"hypertext markup language\">HTML<\/abbr>. An excellent example of this can be found in <a href=\"http:\/\/www.bigsquaredot.com\/\">Big Square Dot<\/a>.<\/p><p>The Big Square Dot page is extremely well designed, but just happens to validate as standard XHTML 1.0 transitional. There are a lot of <code>div<\/code> tags involved, but the complexity of their layout warrants that. Besides, I'm of the school of thought where <strong>some non-semantic markup is necessary to overcome shortcomings in current CSS implementations<\/strong>. Also, all of the HTML inside the <code>div<\/code> tags are semantic, so there are no problems in my opinion.<\/p><p>This kind of page gives me hope that the web design field is progressing in the right direction. After years, standards are finally catching on and making their way to the design side of the fence. Thanks to the improved rendering in newer IE versions and wider adoption of other standards-compliant browsers, it may be a trend that continues to take hold.  Good news for all net citizens!<\/p>","date":"20080217120727","categories":["CSS","HTML"],"comments":[]},{"id":"51","title":"Moving","body":"I'm moving into the new house - I'll try to make up for the missing post later. Thanks for your patience!","date":"20080209181044","categories":["General"],"comments":[]},{"id":"50","title":"Unobtrusive File Tracking with Google Analytics","body":"<p>The <a href=\"http:\/\/analytics.blogspot.com\/\">Google Analytics<\/a> folks recently announced the ability to track downloads of documents with their service. The method provided involved adding a <code>onclick<\/code> attribute to the anchor tag of whatever document you would like to track. Every time someone clicks the link to download\/view the file, the <code>_trackPageview()<\/code> function is called and registers a hit for that file. Pretty simple, eh?<\/p><p>Well, unfortunately, it's not a very clean solution. We're supposed to add a new <code>onclick<\/code> attribute for each file we want tracked? We're supposed to just embed the Javascript right then and there? Isn't there supposed to be separation between presentation, behavior, and content? Ugh, I can feel my markup getting dirtier already.<\/p><p>To avoid garbling up my code, I've created a quick script that adds an event to any links that point to a file (as long as it's file extension is on the list). It requires an <code>addEvent()<\/code> function, like <a href=\"http:\/\/www.dustindiaz.com\/rock-solid-addevent\/\">the Rock Solid <code>addEvent()<\/code> by Dustin Diaz<\/a>, but that should be about it. The script itself is written in <abbr title=\"Javascript object notation\">JSON<\/abbr>, so it should be able to co-exist with any other scripts you have. Here's how it works:<\/p><ul><li><h3>The Extensions Array<\/h3><p>All of the file extensions that should be tracked are kept in an array, <code>ga_file.ext<\/code>. If you'd like to track all Powerpoint slide shows that are downloaded from your site, simply add the string 'ppt' to the array.<\/p><\/li><li><h3>Call the Initialization Function<\/h3><p>The initialization function, <code>ga_file.Init()<\/code>, is called on the page load. It does the majority of the work in the script, including the following:<\/p><ul><li>Get all of the anchors present in the document using the <code>getElementsByTagName()<\/code> function<\/li><li>Check through each anchor, and see if the target is a file with an extension that should be tracked<\/li><li>If the anchor should be tracked, a 'click' event is added that calls the <code>ga_file.Track()<\/code> function<\/li><\/ul><\/li><li><h3>The Tracking Function<\/h3><p>The tracking function, <code>ga_file.Track()<\/code>, is extremely simple. It makes sure the <code>pageTracker<\/code> object exists (this is the object Google Analytics uses for tracking), and if it does, it calls the <code>_trackPageView()<\/code> function to record the hit.<\/p><\/li><\/ul><p>Of course, I don't expect you to take my word for it. Here's the link to the source files.<\/p><ul><li><code><a href=\"http:\/\/www.fragdev.com\/scripts\/ga_file.js\">ga_file.js<\/a><\/code><\/li><li><code><a href=\"http:\/\/www.fragdev.com\/scripts\/ga_file_doc.js\">ga_file_doc.js<\/a><\/code> - With full comments<\/li><\/ul><p>Feel free to use it, but leave the comment at the top with my credit\/link please. Let me know how it works out; this is a very early version, and has not had <strong>any<\/strong> testing, so use at your own risk!<\/p>","date":"20080202190637","categories":["Javascript"],"comments":[]},{"id":"49","title":"IE8's Three Faces","body":"<p>There has been tons of news recently about IE8. It's extremely early in the browser's development, so take it all with a grain of salt, but it has been announced that <a href=\"http:\/\/blogs.msdn.com\/ie\/archive\/2007\/12\/19\/internet-explorer-8-and-acid2-a-milestone.aspx\">IE8 passes the Acid2 test<\/a>, which means the support for standards should be huge leaps and bounds over IE7, and completely surpassing anything IE6 could have hoped for. In effect, <em>very good news.<\/em><\/p><p>Shortly after, there was an <a href=\"http:\/\/alistapart.com\/articles\/beyonddoctype\">announcement on A List Apart<\/a> that set off a wave of criticisms and hurt egos in the community. Apparently, to get IE8's true standard-compliant rendering mode, you would have to insert a meta tag that sets a \"<code>X-UA-Compatible<\/code>\" value to specify which version of IE you'd like to render your page. In effect, <em>news that wasn't as great.<\/em><\/p><p>However, I've decided that I don't care. I'm working on a layout for <a href=\"http:\/\/www.visitlakegeorge.com\">the tourism web site<\/a> that's based on absolute positioning and floats, and if I could get IE to render correctly by coding upside-down in Latin, I'd do it. Adding a simple meta tag just doesn't seem to be that big of a hassle, especially when you consider how many <abbr title=\"Cascading Style Sheets\">CSS<\/abbr> hacks we have to employ currently to get things to work correctly. In addition, there are ways to put IE8 into standards mode <em>without<\/em> using a meta tag:<\/p><ul><li>Use the HTML5 doctype when it's available<\/li><li>Send the \"<code>X-UA-Compatible<\/code>\" value as a <abbr title=\"hypertext transfer protocol\">HTTP<\/abbr> header, either through server configurations or server-side scripting languages like <abbr title=\"PHP hypertext preprocessor\">PHP<\/abbr><\/li><\/ul><p>You could also put up with IE7 rendering, as that will be the default mode for IE8. Somehow, I expect that won't be the most popular decision, no matter how much angst is held against Microsoft and the IE team.<\/p><p>Do I like the fact that we have to make further concessions to the Microsoft monolith to get things to work? No, no I don't. I'm the first person on the anti-Microsoft bandwagon, to the point where I've switched operating systems to get away from them. However, there's one very important thing that should not be overlooked: this could possibly be the end of developers having to work around Internet Explorer, with a single added tag.<\/p><p>I also appreciate the <a href=\"http:\/\/blogs.msdn.com\/ie\/default.aspx\">IE team<\/a>'s desire to disrupt as little as possible with their next release. Supposedly IE7 broke a lot of poorly-designed web sites, and they are not looking forward to that kind of backlash again. This seems like a perfectly reasonable solution to keep everyone at least <em>partially<\/em> satisfied, while also not causing chaos on a large scale for people who don't do web work for a living. It's unrealistic to think that \"Mom 'n Pop dot com\" will be able to run compatibility checks with each new browser release, when many people are blissfully ignorant of the whole concept of browsers in the first place. IE8's rendering modes will keep designers happy, because they will have a standards-based option for their web sites, and the rest of the unwashed masses will be content because the \"Internet Icon\" (You know, the big blue E?) will still bring up their recipe pages without showing them just how lacking the site designer's skills are. They're worried about their lobster bisque, not the state of web standards. That's our job.<\/p>","date":"20080126101336","categories":["CSS","HTML"],"comments":[]},{"id":"48","title":"How To Dodge SQL Injection","body":"<p>Recently, a lot of .gov and .edu web sites have been the target of <abbr title=\"standard query language\">SQL<\/abbr> Injection attacks that seed their database with Javascript that does all sorts of nasty things, including targeting an old RealPlayer vulnerability. For all the gory details on this particular incident, I recommend reading the <a href=\"http:\/\/www.modsecurity.org\/blog\/archives\/2008\/01\/sql_injection_a.html\">Web Security Blog over at ModSecurity.com<\/a> for all the details, or the <a href=\"http:\/\/www.sans.org\/newsletters\/newsbites\/newsbites.php?vol=10&amp;issue=2&amp;portal=18568e8354c1477939922bd793b68360#sID200\">original SANS report of the attacks<\/a>.<\/p><p>As web developers, the integrity of our databases and our web sites are our livelihood. Attacks like this can severely damage our search engine rankings and infect our customers &ndash; neither of which are good for business. These kinds of attacks were bound to happen, because of the lack of understanding concerning SQL Injection, cross-site scripting, and other modern threats that affect the web. So, instead of discussing the impact of these attacks or the specific methodology that was used, I'm going to discuss some ways to prevent this sort of attack from affecting your web site.<\/p><h3>Defending Against Web Attacks<\/h3><p>The first thing you have to understand is how these attacks work. Again, I'm not going to get into the details (there are many other fine sources for that, just <a href=\"http:\/\/www.google.com\">Google<\/a> it), but nearly all of them require a way to modify your page before a victim receives it. This can be achieved through inserting malicious information into forms or <abbr title=\"hypertext transfer protocol\">HTTP<\/abbr> headers, and this is where the majority of defensive measures can be put.<\/p><h4>Filter Input<\/h4><p>If you're receiving input from the outside, you need to <strong>expect the worse<\/strong>. When it's coming in from the outside, input can consist of absolutely everything. It can be null, it can be paragraphs and paragraphs (especially if posted from a form &ndash; the <code>post<\/code> method allows a lot of text, and HTML limits can be overridden), it can be broken unicode input and it can be <abbr title=\"PHP Hypertext preprocessor\">PHP<\/abbr>, Javascript, and SQL code. Make sure to clean your input of any encoded characters, trim it or reject any input that exceeds the size limits you set. Remove any unallowed tags to prevent people from inserting scripts remotely or modifying the appearance of your page.<\/p><p>I tend to do most of these things in a loop, until there are no more changes found. This prevents malicious input from being specifically designed to stick around after the first pass.<\/p><h4>Escape Output<\/h4><p>If you properly escape any output that will be used in HTML or inserted into a database, many attacks will lose their effectiveness. If someone was attempting to end your SQL query by inserting a single quote at the end of their input, ending your query, and inserting a new SQL query of their own after that, properly escaping the data you insert into your queries would prevent their single quote from being interpreted by the database.<\/p><p>There are easier ways to safeguard your database operations, like using the PDO class in PHP or using prepared statements, but you should always escape input sent to a database regardless.<\/p><p>Escaping characters used in HTML like <code>&lt;<\/code> and <code>&gt;<\/code>, make inserting HTML tags into your document rather hard. If the sites affected by the latest SQL injections had been escaping their output, they would have not automatically inserted the <code>&lt;script&gt;<\/code> tags into the bodies of their documents &ndash; they would have simply seen the raw HTML show up in the text of their site. While still not very desirable, at least it would have prevented malicious scripts from being executed on their site.<\/p><h4>Validate Data<\/h4><p>If there is a phone number field on your web site, \"Watermellons\" should not be an accepted value. Incoming data with formatting standards, like phone number and e-mail addresses, should be validated against that format. Addresses, names, and other similar fields cannot be validated against this kind of format, but validating what you can will shrink the number of vulnerable fields in a given form.<\/p><p>Radio buttons, checkboxes, drop down lists, and other fields with a fixed number of options should <em>only<\/em> accept those values. Even though there's ordinarily no way to go beyond those choices in a basic web browser, attackers can easily manipulate your forms to send whatever data they like.<\/p><p>Validating form inputs using Javascript is a great idea, and saves time and bandwidth, but is very easily bypassed. Make sure you have strict data validation at the server level as well!<\/p><h4>Enforce Low Permissions<\/h4><p>If your web site uses a database to house it's pages, make sure the database user that retrieves them for viewing doesn't have write permissions for the database. SQL Injections cannot occur without write access to the database, so whenever possible a read-only connection should be used.<\/p><p>If a certain script (like form processing scripts) needs to be able to write back to the database, set up a database user that only has permissions to write to the tables it has to. Why should your form user, that only has to write to the <code>form_input<\/code> table, also have write permissions to the <code>users<\/code> table?<\/p><hr \/><p>Since the security of our web sites is so important, I think I'm going to write more about it in the future. This gives a few pointers for starting out, but is in no respects a comprehensive guide. For more about securing your web site against SQL Injection and other related attacks, make sure to read up on <a href=\"http:\/\/planet-websecurity.org\/\">Planet Web Security<\/a>. They aggregate many of the top security blogs out there, and provide bleeding-edge updates on the state of web security.<\/p>","date":"20080112110943","categories":["PHP","Javascript","Security"],"comments":[]},{"id":"46","title":"LifeType and Smarty","body":"<p>I've been messing around with the options in <a href=\"http:\/\/www.lifetype.net\">LifeType<\/a>, and I have to say I'm pretty impressed. The options that LifeType offers seem to suit me pretty well, although there are some behaviors that irk me a little. I believe that I'll chalk them up to my inexperience for now, and hope for the best.<\/p><p>There is one part of polish I'm procrastinating, and that's the layout. The default isn't all that bad, but it's not all that good either. Technically it's gangbusters - XHTML compliant right out of the box! The only validation error is the result of a single missing tag: a &lt;p&gt;, and it's missing from one of the posts I carried over. If only more of the internet's HTML was this beautiful... but the layout itself leaves something to be desired.<\/p><p>I looked around, and found that LifeType uses the <a href=\"http:\/\/www.smarty.net\/\">Smarty templating engine<\/a>. I've heard a great deal about this product, so I looked around the internet for a quick <a href=\"http:\/\/www.smarty.net\/crashcourse.php\">introductory tour<\/a>. After some light reading, I dove into the source of the template for the default layout and started hacking it apart.<\/p><p>I haven't gotten very far, but on first impression, the Smarty templates seem to let you put in some basic functionality without going all out with full-blown PHP code. Not bad, not bad. We'll see how it works once I'm finished mangling it - keep an eye out for updates!<\/p>","date":"20080104224959","categories":["PHP"],"comments":[]},{"id":"2","title":"F1RST P0ST!!!1!","body":"<p>\r\nAlright, so it can be done. I have everything up and running, and I'm obviously able to post. The default layout is a little hokey, and I'm stuck using a WYSIWYG (creates HTML for you) editor. I'm sure these things can be changed, but I was just able to get the whole getup working on Thursday night.\r\n<\/p>\r\n<p>\r\nIt seems that LifeType is, indeed, W3C compliant. This was a requirement, and not easy to do with generated content. Nice job, LifeType folks. My only real complaint was the 1,600 files it requires to run. I'm hoping that I can prune off some of that, like the MP3 player flash component.\r\n<\/p>\r\n<p>\r\nOverall, I think this might be a satisfactory blog choice. We'll see how hard it is to port all of my previous blog posts here, and then we'll talk.\r\n<\/p>\r\n<p>\r\n<strong>Edit:<\/strong> After a whole lot of copy and paste, the new blog has all of the old entries copied over. Comments were lost, unfortunately. I'll get back to actual posts right after this... after I figure out how to make this look less 'default'.\r\n<\/p>","date":"20071229100712","categories":["General"],"comments":[]},{"id":"3","title":"Adios, Blogger","body":"<p>Due to some discussions I've had with a <a href=\"http:\/\/theait.blogspot.com\">friend<\/a>, I think I may be leaving Blogger for greener pastures.<\/p><p>My own web site, <a href=\"http:\/\/www.fragdev.com\">FragDev.com<\/a>, has seen some terrible neglect on my part. I believe the last \"news\" I posted there had to do with the work I put in for a local political candidate at the beginning of his campaign. Unfortunately he lost a couple of months ago, and his blog's been deleted. If the subject of news ceases to be, does it still qualify as news?<\/p><p>Anyways, I'm going to be trying to set up my own blogging software and see how that goes. I've toyed around with writing my own, but that seems like way too much trouble for what it's worth. The posting bits would be easy (I write all my posts in HTML anyways), but comments could potentially be a beast to work out. Throw in elements like <abbr title=\"really simple syndication\">RSS<\/abbr> feeds and I'm starting to think that downloading open source blogging software doesn't sound like a bad deal.<\/p><p>While I've enjoyed blogging with Blogger, I think I'd like more control over my blog. I'd also like it if I had a neat-o web address like \"http:\/\/blog.fragdev.com\" or something akin to that, since I've been moving my blog and my business closer and closer in theme and purpose. Bringing a little pagerank to the fragdev-dot-com homepage couldn't hurt, either. Whatever I do, I'll leave a link here when I get everything up and kickin'.<\/p>","date":"20071221113348","categories":["General"],"comments":[]},{"id":"6","title":"The Times We Live In","body":"<p>From the moment I was introduced to the <a href=\"http:\/\/www.opensource.org\/\">open source movement<\/a> and <a href=\"http:\/\/www.fsf.org\/\">free software<\/a> (as in speech*), I've tried to embrace it. For a web developer, free and open software seems like a perfect pair for the free and open nature of the internet. I've grown accustom to looking under the hood of any web site I come upon, so why should the browser or operating system I use be any different?<\/p><p>If free and open software makes sense to you, or is even something you're interested in, this is a very exciting time to be alive.<\/p><p>Free and open software is just getting it's start. There have been rumblings from the movement since the early nineties, but just in the past couple of years has this idea really taken off - largely due to the opening <a href=\"http:\/\/www.microsoft.com\">Microsoft<\/a> left by letting IE6 stagnate for years and years. Enter <a href=\"http:\/\/www.mozilla.com\">Firefox<\/a>, a wonderful open-source browser that you could download for free. Safer than IE, better than IE, with plug-ins that made it gangbusters. Now, if you're a web developer worth your salt, you have Firefox installed with the <a href=\"http:\/\/www.getfirebug.com\/\">Firebug<\/a> extension.<\/p><p>These days it's not uncommon for someone to deviate away from the Microsoft way of life. <a href=\"http:\/\/www.apple.com\">Macs<\/a> are becoming hugely popular among old UNIX admins, newer designers and programmers, and even mom-and-pop types that just want to have a computer that works &ndash; and works well. You know what Mac OSX is based on? The open source <a href=\"http:\/\/en.wikipedia.org\/wiki\/XNU\">XNU kernel<\/a>, which has elements of an open-source UNIX variant built in.<\/p><p>But what really makes things exciting is Linux. The Linux operating system is completely free, can be installed on whatever hardware you have lying around, can be customized for absolutely any purpose, and kinda works. Sorta. Most of the time. But that's what makes it so exciting!<\/p><p>If you're using open source, you're on the frontier of computers. It's like the original days of computing, when the corporations weren't making the innovations, they were being made by ordinary guys and gals with brains and too much spare time. You could be the next <a href=\"http:\/\/www.woz.org\/\">Steve Wozniak<\/a>, or work with <a href=\"http:\/\/www.linux.org\/info\/linus.html\">Linus Torvalds<\/a>. Free and open software allows you to make a difference in the world of computing. Seriously, how many other chances are you going to have to make your \"I changed the course of modern computing\" story to tell you grandkids?<\/p>","date":"20071215114935","categories":["Linux"],"comments":[]},{"id":"5","title":"Internal Links: Anchors Away","body":"<p>After I wrote my post about <a href=\"http:\/\/nocturnalvagrant.blogspot.com\/2007\/11\/whats-in-name.html\">using internal links<\/a>, I discovered that my original technique of using anchor tags is far out of date. Modern technology has given us a much simpler, much slimmer, much snazzier way to link to your content, and it's seen cross-browser support for years.<\/p><p>Recently, I was re-visiting an older page that used the old <code>&lt;a name=\"myName\"&gt;&lt;\/a&gt;<\/code> syntax, and decided to update it. However, the internal link was nested inside an <code>H3<\/code> tag, so I tried this:<\/p><p><code>&lt;h3 id=\"myName\"&gt;Header Text&lt;\/h3&gt;<\/code><\/p><p>It worked like a charm. I quickly loaded up the oldest browsers I could find, and found that this syntax has been supported in IE since version 5.0 at least, and the only browser I had installed that didn't support linking directly without an anchor was Netscape 4.8.<\/p><p>So, if you're worried about your burgeoning Netscape 4.8 user base, I suggest you stick to the old anchor method. Otherwise, a good ID will do ya.<\/p>","date":"20071211114625","categories":["HTML"],"comments":[]},{"id":"4","title":"Intermission 2007","body":"<p>Sorry I have not been more attentive here at the FragDev blog, but this December is turning out to be a killer! For more details (that I won't bother pouring out here), feel free to check my <a href=\"http:\/\/www.xanga.com\/nocturnalvagrant\/\">personal blog on Xanga<\/a>.<\/p>","date":"20071209113600","categories":["General"],"comments":[]},{"id":"7","title":"Homebrew","body":"<p>My PC is five years old, and starting to show it's age. I built it during my senior year of high school, piece by piece, with extra money I saved up from my pizza delivery job. I bought the more static components first (pieces that wouldn't be outdated as soon as I bought them), like the case and the fans. Slowly, I worked up to the main components, and eventually I had a full computer.<\/p><p>Somehow, it's lasted this long and has handled every program I have thrown at it, but like I mentioned earlier, it's time for an upgrade. While I probably could upgrade the machine itself, I think I'm going to leave it just as it is. I can always use the extra PC, and building a new PC from scratch sounds like <strong>too much fun to pass up.<\/strong><\/p><p>Don't get me wrong &ndash; creating a computer from the various components is much more work than simply going to Dell and buying one. Also, building your own computer does not save you as much money as it did \"back in the day\". All of that aside, <strong>building your own computer is worth it.<\/strong> You develop such a strong understanding of hardware specifics, and how each affects the performance of your machine. After a while, you get a feeling what really makes a difference to your <em>personal<\/em> experience. For instance, my computers really serve me well if I overload the <abbr title=\"random access memory\">RAM<\/abbr> and get a powerhouse video card - primarily because of my love of video games. Hardcore programmers might find that the processor and <abbr title=\"front side bus\">FSB<\/abbr> make more of a difference, where multimedia editors might want to focus more on the speed of their hard drives.<\/p><p>Next time you feel your system is showing it's age, think about replacing it with a computer you build yourself. The best way to learn about computer fundamentals is starting from scratch and working your way up, and it's a very enjoyable process &ndash; Once you do it yourself, you never go back.<\/p>","date":"20071124115318","categories":["Linux"],"comments":[]},{"id":"8","title":"Wine and Dine Your Windows Games","body":"<p>I've been messing around quite a bit with my Linux installation (I'm currently running <a href=\"http:\/\/www.kubuntu.org\">Kubuntu Linux 7.10<\/a>) because I'd really like to stay away from my <a href=\"http:\/\/www.microsoft.com\/windows\/\">Windows<\/a> partition as much as possible. A big part of Windows' necessity for me has to do with my crippling addiction to games.<\/p><p>One of the ways to bridge the gap between Linux and Windows games is to use <a href=\"http:\/\/www.winehq.org\">Wine<\/a>, an implementation of the Windows <abbr title=\"Application programmer interface\">API<\/abbr> that runs in Linux. This essentially allows you to run Windows programs in Linux, with a few caveats.<\/p><p>I've gone through two experiments with running games under Wine: <a href=\"http:\/\/www.valvesoftware.com\">Valve's<\/a> <a href=\"http:\/\/www.steampowered.com\">Steam<\/a> games, specifically the 1st-person puzzle game <a href=\"http:\/\/www.whatistheorangebox.com\/portal.html\">Portal<\/a>, and a great independently-developed space-based shooter named <a href=\"http:\/\/www.neurohack.com\/transcendence\/\">Transcendence<\/a> (think Asteroids-style navigation with an in-depth space travel sim behind it). I've had quite different experiences with each of these titles running under Wine.<\/p><p>Transcendence was by far the easiest to get up and running, which was a big suprise. It turns out that this application doesn't tie into the registry or register itself with the Windows installer, and instead is basically just a standalone executable file. This makes it much less complicated to run under Wine. All that was required to open the game in all it's glory was for me to change to the Transcendence directory, and open the executable using Wine:<\/p><p><code>wine transcendence.exe<\/code><\/p><p>Presto, I was shooting around the galaxy in no time. To make sure that my Windows environment saved to the same location as my Linux environment, I used a symbolic link to share the directory across the file systems. Sounds complicated, but it boils down to using one folder in two places. Here's the command I used:<\/p><p><code>ln -s \/[<i>windows partition<\/i>]\/transcendence\/ ~\/.wine\/drive_c\/transcendence\/<\/code><\/p><p>That was really it, too. No problems, no wacky configurations or switches I had to research, it just worked. The developer had mentioned that he had attempted to get away from Direct-X to allow this sort of thing, and I have to applaud him. While the game does run a little bit slower on my PC without Direct-X, it's not noticeable. If he ever provides a way to donate money or buy Transcendence, sign me up.<\/p><p>With Steam and Portal, however, the process wasn't as smooth. First of all, the Steam installer is distributed in a .msi file now, which is Microsoft's proprietary installer. This makes it a little harder to install using Wine, but not impossible. I found a great <a href=\"http:\/\/wiki.archlinux.org\/index.php\/Steam\">how-to guide for installing Steam using Wine<\/a> on the <a href=\"http:\/\/wiki.archlinux.org\/index.php\/Main_Page\">ArchLinux Wiki<\/a> that helped me out with a command that would run the installer:<\/p><p><code>wine msiexec \/i SteamInstall.msi<\/code><\/p><p>Not bad, eh? With that, Steam installed just fine and ran without a hitch. The problem came with the games.<\/p><p>Since each Steam game is pretty hefty, downloading each one again over my internet connection just didn't make any sense when I already had them installed on my Windows partition. I tried the symlink trick, but Steam encountered problems when trying to run after then. I quickly scrapped that approach.<\/p><p>Since Valve is also interested in not making me re-download gigabytes of data from their servers, they have provided a neat feature of their Steam client, called \"Backup Games\", that allows you to back up your game data to your hard-drive. I backed up a couple of games I was interested in trying out in Linux (13 GB for Half-Life 2, Portal, Team Fortress 2, Half-Life 2: Episode 2), and restored them using Wine. Not expecting much, I ran Steam and tried launching Portal.<\/p><p>It worked. I was pretty shocked, but did notice that there was a <strong>huge<\/strong> performance hit. Apparently my hardware is very Direct-X friendly, because Portal dropped down to around five frames per second when running it under Wine. Not playable at all, but everything seemed to work. A small setback for such a major victory.<\/p><p>For now, I'll be playing a lot of Transcendence until I can scrap together enough money to build a new PC. My current computer has served me well, but it's showing it's limits, and I think it's time for an upgrade. I'm going to try and upgrade to 64-bit Kubuntu, to see if I can eek some more performance out of my AMD64 processor. But with all things considered, I'd say that Linux gaming may finally be something we can take off our wish lists, if only to replace it with \"Native Linux games\". But let's not get ahead of ourselves. :-)<\/p>","date":"20071117115510","categories":["Linux"],"comments":[]},{"id":"9","title":"Compress Your Content","body":"<p>\"My, loading that web site was entirely too fast for my tastes. I wish the authors of this page would slow it down a bit!\"<\/p><p>Never in the history of computing will you ever hear the statement above spoken out loud - well, at least not seriously. When it comes to load time, <strong>there's no such thing as too fast<\/strong>, and your visitors will thank you if you embrace that concept.<\/p><p>So... what is a conscientious web developer to do?<\/p><p>Next to good design practices, <abbr title=\"hypertext transfer protocol\">HTTP<\/abbr> compression is one of the best tools we have to save our visitor's time. This technology works at the server level, so if you use a web host, you'll have to talk to them.<\/p><p>The way it works, without getting too technical, is a lot like creating a ZIP archive. Each bit of information (with a few exceptions), gets sent through a compression mechanism if the other side supports it. You use up much less bandwidth than you normally would, and all it costs you is a little processor time. Since your processor time is almost always cheaper and more abundant than bandwidth, this is a win-win situation - and <strong>all of your pages load much faster<\/strong> as a result.<\/p><p>Now, the drawbacks. HTTP compression works fantastically on text, like static <abbr title=\"Hypertext markup language\">HTML<\/abbr> documents and dynamically generated pages (like <abbr title=\"Active server pages\">ASP<\/abbr>.net and <abbr title=\"PHP Hypertext Preprocessor\">PHP<\/abbr>). With everything else, it's hit or miss. For instance, I'm under the impression that Javascript and CSS files should <em>not<\/em> be compressed. The browser needs to get these files as fast as possible to render your page correctly, and adding another step (decompression) in-between receiving the file and rendering your page could cause some display problems. A flash of unstyled content could result, and that might not be acceptable.<\/p><p>In addition, you shouldn't compress files that are already compressed. Compressing information more than once can lead to data loss... I think. I'm speaking from information gathered ten years ago, but I believe the basic concepts haven't changed much. Also, compressing content that's already been compressed, like re-ZIPing a ZIP file, takes a long time to process and doesn't gain you that much.<\/p><p>Now, certain file formats (Flash, <abbr title=\"portable document format\">PDF<\/abbr>, OpenDocument, images, etc.) already come compressed, so you shouldn't use HTTP compression on those. Everything else is fair game, as long as you look into the file formats.<\/p><p>Give HTTP compression some thought, it'll help you save on bandwidth expenses and help you save your visitors some time as well.<\/p>","date":"20071110115650","categories":["General"],"comments":[]},{"id":"11","title":"What's In A Name?","body":"<p>While re-designing a page that relied heavily on internal linking, I ran into a problem using a numeral at the beginning of the <code>name<\/code> attribute. Whenever I used a name that started with a digit, the validator returned an error. This had never happened before, so I checked the reasoning behind the error<a href=\"#wian_f1\">*<\/a>.<\/p><p>Apparently the <code>name<\/code> attribute has been deprecated, and the <code>id<\/code> attribute is now used instead.<\/p><p>I think this is great for quite a few reasons, one being that 'id' is shorter than 'name', saving me two characters on each internal link. I know, it's not much, but eventually that will add up!<\/p><p>I also like this new change because it makes so much sense. All the <code>name<\/code> attribute ever really did was give an ID to an anchor, so we're really cutting the pretense and getting straight to the point.<\/p><p>I've yet to research how much browser support this has so far, so for now I'm using both for backwards compatibility. The <code>name<\/code> attribute is still valid, it's just deprecated, so <code>&lt;a name=\"foo\" id=\"foo\"&gt;&lt;\/a&gt;<\/code> is a perfectly valid internal reference. Just watch your naming conventions!<\/p><p><a name=\"wian_f1\" id=\"wian_f1\">*<\/a> I use the <a href=\"https:\/\/addons.mozilla.org\/en-US\/firefox\/addon\/249\">HTML Validator<\/a> extension with <a href=\"http:\/\/www.mozilla.com\">Firefox<\/a>, which allows you to view all validation errors in real-time, as well as being able to pick out errors in your source code, and explain why they're errors.<\/p>","date":"20071102120931","categories":["General"],"comments":[]},{"id":"12","title":"Linux - Our Day Has Come","body":"<p>I heard that <a href=\"http:\/\/www.kubuntu.org\">Kubuntu<\/a>, my favorite flavor of <a href=\"http:\/\/www.ubuntu.com\">Ubuntu<\/a>, had a new version out. Since I run a dual-boot system with Windows XP and Kubuntu, I did my duty and downloaded the latest version, which just happens to be 7.10 (Gutsy). While I was starting the install process, I noticed a small blue signal strength graph in my taskbar.<\/p><p>I bought a separate USB wireless adapter for Linux a while back, because my Linksys PCI card did not seem to behave well with Linux. But the USB devices were still sitting on my shelf, disconnected, because I hadn't finished setting up the machine yet (and they only worked for about fifteen minutes on average, so I wanted to save them for updates and package installation). But there it was, telling me that I had a wireless signal strength of about 90%.<\/p><p>I double-checked to make sure I hadn't somehow left one hooked up, and finding nothing, dropped to my knees with arms raised to the sky. <strong>Finally, decent wireless support in Linux.<\/strong><\/p><p>I'm beginning my first Linux-only day in a long time, and it's a good feeling. Nigh, a <em>wonderful<\/em> feeling. This leaves one major barrier to my ditching Windows entirely: games. But with some experiments I've been doing with Wine, that may be a thing of the past as well. For anyone who's been waiting for the right time to switch over to Linux... well, this is it. Our day has come.<\/p>","date":"20071020121122","categories":["Linux"],"comments":[]},{"id":"13","title":"Avoid 404 Messages","body":"<p>There's nothing more shameful, nothing more embarrassing than finding that one of the links on your page is dead. If you're going for the quaint amateur-ish designer look, then let the links on your site lead to 404 errors. I can't think of any better way to lower a visitor's opinion of your competence...<\/p><p>...Well, maybe there is <em>one<\/em> thing that's more of a \"faux-pas\" &mdash; causing 404 messages for people linking to your site.  If you ever expect to have a successful web site, one of the keys is <strong>not abusing people who link to you.<\/strong><\/p><p>Inbound links are invaluable to any web page, by providing direct traffic and increasing your chances of being listed in the top search listings. So it's your duty as a web citizen to keep your site structure fairly stable, and prevent breaking any direct links to your pages. If someone has been kind enough to link to you, don't pull that page out from under them.<\/p><p>In a perfect world, that would be that &mdash; end of discussion. Instead, there's almost always going to be a situation where you need to move or rename a page on your web site. Luckily, there are several ways to do this without breaking links.<\/p><h3><abbr title=\"hypertext markup language\">HTML<\/abbr> Headers<\/h3><p>HTML headers are sent between the browser and the server, and are a great way to redirect people to the new location of the page. When someone requests the old file, simply send them these two headers instead:<\/p><p><code>HTTP\/1.1 301 Moved Permanently<br \/>Location: newfile.html<\/code><\/p><p>Easy as that. Now anyone who visits the old <abbr title=\"universal resource location\">URL<\/abbr> will be taken to the new updated one, and anyone who cares (search engine spiders, webmasters checking their links) will know that the link in question is an old link and should be updated.<\/p><p>These headers can be sent from the web server software (<abbr title=\"Internet Information Server\">IIS<\/abbr> or <a href=\"http:\/\/www.apache.org\">Apache<\/a>), or can be sent through scripting languages (<abbr title=\"PHP Hypertext Pre-Processor\">PHP<\/abbr>'s <code>header<\/code> function).<\/p><h3>Javascript\/Meta Refresh<\/h3><p>If you don't have access at the server level, and don't have the ability to use a scripting language, you can always use the HTML meta tag option or a short Javascript function. Just make sure to display a message to the user beforehand, to prevent confusion. This will at least get people and spiders to the appropriate file.<\/p><p>I would post an example here, but you can probably find a better example if you search for the term \"meta\/javascript refresh\/redirect\".<\/p><p>People who link to you are doing you a favor; return the favor by making sure those links always lead somewhere!<\/p>","date":"20070928121357","categories":["General"],"comments":[]},{"id":"14","title":"Do It Hard, Do It Once: Part 1","body":"<p>I'm a hardcore web guy. I dive straight into the mucky muck of tags and CSS and server stuff and I love it that way. I code each piece of <abbr title=\"Hypertext Markup Language\">HTML<\/abbr> or <abbr title=\"Cascading style sheets\">CSS<\/abbr> in a page by hand. I use two tools when doing web work: <a href=\"http:\/\/www.gimp.org\">The GIMP<\/a> for all my image needs, and <a href=\"http:\/\/www.pspad.com\">PSPad<\/a> for absolutely everything else, and with these tools I manage two highly complicated web sites. At last check, they have over 700 documents (pages, downloadable documents like PDFs) between them.<\/p><p>Managing this much content incorrectly is a good way to become an alcoholic. Unfortunately, I've never been a big drinker, so I have to create techniques that allow me to manage this much stuff without losing my mind. That, in essence, is what this whole entry is about.<\/p><h2>Templating<\/h2><p>Do you have a navigation bar that is common across several pages? Redundant elements that can be reused? Need to make site-wide changes without a ton of work? Then templating is for you. <strong>Templating is the single easiest way to make web sites more manageable,<\/strong> by grouping together reusable pieces of the page (like navigation) and using server side scripting languages to include them when needed. This not only makes it easier and faster to build pages, but it makes it much easier to maintain these elements across the site. The more code you reuse, the less you have to rewrite.<\/p><h2>Separation of Presentation, Content, and Behavior<\/h2><p>In the early days of the web, there was one file: index.htm, which held the entire web site content. When methods of embedding images came along, there was the index and the image files. As web sites started to grow, more and more technologies came along to allow the separation of different elements in a page. Currently, we have the following to use:<\/p><ul><li>HTML for structure<\/li><li>CSS for presentation<\/li><li>Javascript for behavior<\/li><\/ul><p>Keeping these elements of a page separated makes pages much more manageable. If all aspects of a page are mashed into one file, like old table-based layouts, editing a single piece of a page becomes a game of hide-and-seek. <strong>Separation of structure, presentation, and behavior make code more readable and organized<\/strong> and make navigating that code much faster. Organized code also lends itself much better to templating, which is a web guy's best friend.<\/p><hr \/><p>This is an ongoing process, so I will post more as I go. Keep an eye out for updates!<\/p>","date":"20070913121454","categories":["General"],"comments":[]},{"id":"15","title":"JSON: Prequel Post","body":"<p>What I know about <abbr title=\"Javascript Object Notation\">JSON<\/abbr> can be summed up easily, placed on a post-it note, and stuck to your monitor as a (somewhat) helpful reminder. What I know about <abbr title=\"Javascript Object Notation\">JSON<\/abbr> is this:<\/p><p><abbr title=\"Javascript Object Notation\">JSON<\/abbr> is the velvet rope of JavaScript.<\/p><p>One of the reasons I can sum things up so concisely is because I have no idea how to use <abbr title=\"Javascript Object Notation\">JSON<\/abbr>. I've read a few articles, looked at a few tutorials, and gotten myself nowhere. When I learn more, I will post it in this blog and link to it from this post.<\/p><p><strong>This space reserved for link to my infinite future knowledge<\/strong><\/p><p>Until then, may I humbly suggest <a href=\"http:\/\/www.dustindiaz.com\/\">Web Standards With Imagination<\/a>, a blog maintained by Dustin Diaz. He's the guy that introduced me to this stuff, and where JavaScript is concerned, he is the Dalai Lama to my plain-old Llama.<\/p>","date":"20070713121653","categories":["Javascript"],"comments":[]},{"id":"16","title":"IE7: Same Old Story","body":"<p>I've been exploring the way Internet Explorer 7 handles things, and I'm overwhelmingly disappointed. IE7 suffers from the same \"Microsoftitis\" as most Microsoft products - which means that it behaves the way Microsoft believes it should, and not the way the rest of the world does.<\/p><p>The fact that Microsof has a monopoly (not a near monopoly, not a partial monopoly, a full-blown illegal monopoly) means that they set the de facto standard with whatever they do. This is infuriating as a web developer, when the rest of the world has already dictated how things must be done.<\/p><p>With IE7, the standards set forth by the W3C just doesn't seem to cut it. Granted, they're getting slightly better, but with the amount of time they had been working at it, they should have fixed many more of the problems they have. IE 3, 4, and 5 were released within a year of each other. Each version was leaps and bounds above the other. IE 6 was released three years after IE 5, and was a huge improvement over IE 5.<\/p><p>IE 6 was released in 2001, and IE 7 was released in November of 2006. Nearly five years in-between. I count three major improvements so far: Shiny new interface with tabs, some CSS bugs fixed, and the Zoom feature.<\/p><p>The IE rendering is nearly the same as IE6, with the same quirks that make it challenging to design a standardized page that looks good in IE. In fact, the lack of some CSS bugs remove the ability to use CSS hacks, so in that case designers and developers are basically back to square one.<\/p><p>The introduction of tabs in IE7... well... welcome to the party, guys.<\/p><p>As for the zoom feature... I was genuinely impressed by IE7's zoom. It's generally a great idea, especially for those who have low vision. Mind you, Opera's had this forever, but that's not the point. At least Microsoft's trying.<\/p><p>Then I zoomed in on one of my layouts, and found a terrible terrible bug that actually split words in two and sent them to opposite sides of the screen. While somewhat disappointing, I still haven't given up on it. It needs some work, but it's not a bad step.<\/p><p>So, if the trend of IE releases hold, and Microsoft gives up it's \"my way or the highway\" policy, we may just have a decent standardized browser to develop for when 2014 rolls around.<\/p>","date":"20070623121713","categories":["General"],"comments":[]},{"id":"17","title":"Safari for Windows: A Brilliant Move","body":"<p>In an earlier post, I described why I thought it was <strong>brilliant of Apple to release the Safari browser for PC<\/strong>. Now that I have a little more time to elaborate, I will do so.<\/p><h4>Number One: Compatibility<\/h4><p>By far and away, the best reason for Apple to bring their browser to Windows is compatibility. As a Windows user, I download each and every browser out there that will run on my PC. I have <abbr title=\"Internet Explorer\">IE<\/abbr> going all the way back to version 3, Netscape from Navigator 2 Gold and forward, a bunch of old Opera and Firefox versions, and even some from the text-based realm like Lynx. I don't use them all the time, but I've loaded each of my layouts in them at least once.<\/p><p>I also keep a Linux boot CD handy - Knoppix for KDE, Ubuntu for Gnome (I also use Kubuntu from home, but don't have that CD at work. Go figure) - and I test those environments as well. Linux users don't make up a large share of my visitors, but so what. They'll never make up a large share if my sites don't work on their browsers.<\/p><p>Macs presented a special problem. While their browser, Safari, was based on KHTML, it did things a little differently. Also, Macs are not cheap, so buying one just for testing purposes was completely out of the question. My solution was to load up as many of my sites in Safari whenever I had access to a Mac, and hope that they rendered well.<\/p><p>But with Safari on Windows, my problem is solved. I can make sure all of my pages render for my Mac friends, and I don't have to invest a dime. <strong>This gives anyone using a Mac a better chance of viewing a well-polished page<\/strong>, which will make for a better experience for Mac users. What company wouldn't want more satisfied customers?<\/p><h4>Number Two: Familiarity<\/h4><p>I am a PC user, and I hate Windows. It's clunky, ugly, bloated, buggy, insecure, and expensive. I would love to get away from Windows... but I can't.<\/p><p>I've spent nearly fifteen years learning how everything works on Windows, and I couldn't possibly just jump into a new environment. I've looked into converting to Linux, but it hasn't come together for me just yet. I've given some thought to Macs, but never very seriously, because <strong>Macs are completely foreign to most PC users<\/strong>. I wouldn't really know where to start, because I'm not familiar with any of the programs or interfaces.<\/p><p>This is where the real genius is. ITunes, Safari, and QuickTime are all common occurances on most PCs nowadays. All of them sport the brushed Mac interface, all of them share their counterpart's functionality, all of them have versions that are free to download and use. <strong>Everyone using this software has a little Mac exposure.<\/strong> Each installation is like an Apple ambassador, bringing the everyday PC user a taste of the good life - and making it a little bit easier to warm up to a Mac. If you've used all of the programs, then half the battle has already been fought.<\/p><h4>Number Three: See One and Two<\/h4><p>That's really all their is to it. Apple has made a very strategic move by releasing Safari on Windows, one that I do not believe they will regret.<\/p>","date":"20070619121829","categories":["General"],"comments":[]},{"id":"18","title":"Update: Bye Bye Background Bug","body":"<p><em><strong>Note:<\/strong> This is an update to an earlier post. To get the whole story, read <a href=\"http:\/\/nocturnalvagrant.blogspot.com\/2007\/06\/safaris-wmode-blinkey-background-bug.html\">Safari's Blinkey Background Bug<\/a>.<\/em><\/p><p>Due to my influence on the developers behind Safari (*snort*), the browser bug dealing with background colors of positioned elements and Flash objects using a wmode value of 'opaque' has been corrected in the new Safari beta. This is great news for developers, because there was no workaround or hack available.<\/p><p>I'll post more about the brilliance of making Safari available for Windows a little bit later.<\/p>","date":"20070612122052","categories":["General"],"comments":[]},{"id":"19","title":"Safari's WMODE Blinkey Background Bug","body":"<p><em><strong>Note:<\/strong> This post is out of date. To see the stunning conclusion, read the <a href=\"http:\/\/nocturnalvagrant.blogspot.com\/2007\/06\/update-bye-bye-background-bug.html\">update<\/a>!<\/em><\/p><p>With the new <a href=\"http:\/\/www.visitlakegeorge.com\">Tourism<\/a> web site, I've been introduced to a whole new world of browser bugs - the bugs associated with using Flash.<\/p><p>Since this is my first foray into Flash, I tried to use as little of the stuff as possible. The design called for the use of a flash-animated header with a integrated navigation menu. My usability alarm immediately went off: \"you can't put a piece of the navigation structure inside of Flash! What about people who have flash disabled? What about people using screen readers or text-only browsers! For God sake's man, think of the spiders!\"<\/p><p>So, I crafted a particularly tricky piece of <abbr title=\"Cascading Style Sheets\">CSS<\/abbr> and HTML, and positioned a DIV containing an unordered list over the flash. At first, it disappeared entirely - but I was not daunted.<\/p><p>Some of my video experience reminded me that video is a tricky beast, and isn't always displayed like other items on your screen. So, I did some digging and discovered that the problem was indeed the display mode of the flash. A quick addition of the 'wmode' attribute (set to 'opaque') and we were off and running. It was accessible, it was pretty, it looked like the perfect solution! I ran up to the designer, and we loaded it up in Safari.<\/p><p>She was impressed by the appearance, and seemed genuinely happy with how it had worked out. Then she hovered over one of the links, and the box disappeared.<\/p><p>I was unprepared for that, to say the least, so I did a little digging on <a href=\"http:\/\/www.google.com\">Google<\/a>. It turns out that there is a bug in Safari that causes problems with hovering elements positioned over Flash, and there's no work around currently.<\/p><p>I quickly assured our designer that it was only a Safari bug (the majority of our visitors are using IE variants), and that I would do all I could to resolve it. With a little more digging, I discovered that applying a background image worked marginally better than using a background color in our situation, so I applied a 1X1px image of the color white. The link text still had a white background, but the container DIV still always lost it's background color.<\/p><p>I believe I've come as far as I can with this particular bug, and the rest is going to have to be done by the folks behind Safari.<\/p>","date":"20070608122226","categories":["General"],"comments":[]},{"id":"10","title":"Safari's WMODE Blinkey Background Bug","body":"<p><em><strong>Note:<\/strong> This post is out of date. To see the stunning conclusion, read the <a href=\"http:\/\/nocturnalvagrant.blogspot.com\/2007\/06\/update-bye-bye-background-bug.html\">update<\/a>!<\/em><\/p><p>With the new <a href=\"http:\/\/www.visitlakegeorge.com\">Tourism<\/a> web site, I've been introduced to a whole new world of browser bugs - the bugs associated with using Flash.<\/p><p>Since this is my first foray into Flash, I tried to use as little of the stuff as possible. The design called for the use of a flash-animated header with a integrated navigation menu. My usability alarm immediately went off: \"you can't put a piece of the navigation structure inside of Flash! What about people who have flash disabled? What about people using screen readers or text-only browsers! For God sake's man, think of the spiders!\"<\/p><p>So, I crafted a particularly tricky piece of <abbr title=\"Cascading Style Sheets\">CSS<\/abbr> and HTML, and positioned a DIV containing an unordered list over the flash. At first, it disappeared entirely - but I was not daunted.<\/p><p>Some of my video experience reminded me that video is a tricky beast, and isn't always displayed like other items on your screen. So, I did some digging and discovered that the problem was indeed the display mode of the flash. A quick addition of the 'wmode' attribute (set to 'opaque') and we were off and running. It was accessible, it was pretty, it looked like the perfect solution! I ran up to the designer, and we loaded it up in Safari.<\/p><p>She was impressed by the appearance, and seemed genuinely happy with how it had worked out. Then she hovered over one of the links, and the box disappeared.<\/p><p>I was unprepared for that, to say the least, so I did a little digging on <a href=\"http:\/\/www.google.com\">Google<\/a>. It turns out that there is a bug in Safari that causes problems with hovering elements positioned over Flash, and there's no work around currently.<\/p><p>I quickly assured our designer that it was only a Safari bug (the majority of our visitors are using IE variants), and that I would do all I could to resolve it. With a little more digging, I discovered that applying a background image worked marginally better than using a background color in our situation, so I applied a 1X1px image of the color white. The link text still had a white background, but the container DIV still always lost it's background color.<\/p><p>I believe I've come as far as I can with this particular bug, and the rest is going to have to be done by the folks behind Safari.<\/p>","date":"20070608120717","categories":["General"],"comments":[]},{"id":"20","title":"Designer Vs. Developer","body":"<p>I am a web <em>developer<\/em>. I develop web sites, the code behind them, and most technical aspects associated with interactions on the web. I am concerned primarily about <strong>function, speed, efficiency and usability<\/strong>.<\/p><p>I am not a web <em>designer<\/em>, even though I try. Web designers <em>design<\/em> web sites, and focus on the aesthetics and layout of a page. Their primary focuses involve <strong>presentation, appearance, and beauty<\/strong>*.<\/p><p>When web designers and developers need to work together, sometimes differences in opinion crop up. Sometimes quarrels break out. Sometimes people agree to disagree, and sometimes people die.<\/p><p>...Okay, so nobody dies. However, somehow the designer and developer need to come to a consensus. There is usually a middle-ground to be had, but the trouble is getting there. Misunderstandings on both sides can get in the way; maybe the designer isn't used to designing for the web, so they expect the precision of other fields of design. Maybe the developer has never had to delve too deep into the CSS properties that have to do with typography, and are poorly equipped to use them.<\/p><p>Whatever your position, designer or developer, take it upon yourself to find that middle ground. If you're working with someone from the opposite camp who refuses to budge, <strong>find a compromise that works for both parties<\/strong>. It's much easier to work with someone who's willing to cooperate, and if you prove that you take their opinions and concerns seriously, they're more apt to respect yours and take them into account. Someday we may not have to choose between graphical elements and handicapped usability, but until then, try to be the good guy. Stick to your guns, but don't shoot yourself in the foot.<\/p><p>* Like I said, I'm no designer. I am just speculating here.<\/p>","date":"20070522122434","categories":["General"],"comments":[]},{"id":"21","title":"Code Like They're Watching","body":"<p>This week, one of my co-workers began working on a ticket that I had started. The situation involved an ASP.NET script, a stored procedure, and <abbr title=\"comma separated values\">CSV<\/abbr> and Database data sources. It was a fairly complicated issue that involved a 3rd party - they supplied the CSV file. It turns out that they had changed the formatting of the CSV file, which botched up our import script quite thoroughly.<\/p><p>I supplied my co-worker with the script, and started showing him what I had come up with so far, when we ran into some of my debugging code. Since I was working alone on this project, I had some fun with variable names (dim stupid, broken;). Luckily that section had been commented out, so he didn't seem to mind that too much.<\/p><p>However, we continued on in the code and ran into a piece of debuggery that was still in place: the 'coolguy()' function. I assume that I named it \"coolguy\" because I assumed I was, indeed, a cool guy. However, when my co-worker asked \"Okay, so what's coolguy() do?\" I had to re-assess my naming conventions.<\/p><p>Not only had I left out any semblance of comments, I hadn't given my functions or variables meaningful names. <strong>I was one of <em>those<\/em> coders<\/strong>. I was not a cool guy.<\/p><p>I sheepishly informed him what I thought the function did, but also had to admit that I wasn't sure. Coolguy wasn't ringing any bells, because I gave things silly names all the time. My intro to programming instructor popped briefly into my mind - she was shaking her head. If I had decided to be a samurai instead of a web designer, I would be ritualistically ending my sad existence right now.<\/p><p>Moral of the story: even if you're just goofing around, trying to fix something, make sure to take it seriously - <strong>code like you're working in a team, and you're submitting your program to five other people<\/strong>, all of which are higher up in the food chain than you are. Who knows when someone else might shed some light on the programs you've been writing... but you can make sure they don't get any of your abundant personality quirks with it. *sigh*<\/p>","date":"20070421122531","categories":["General"],"comments":[]},{"id":"23","title":"Emergency Response","body":"<p>I'm at work, but I'm not at work. I'm sitting in the Public Safety building, in a meeting room, with other essential staff. Certain public offices, like Public Health and the County Clerk, have a skeleton crew occupying a couple of seats. Computers and phones are set up where they're neccessary, and people come and go like it's business as usual.<\/p><p>Yesterday, the main electrical point of entry caught fire and started arking all over the basement. The backup generator kicked in, which caused more fireworks. The building lost power, and acrid smoke filled the halls. Our network coordinator scrambled to power down the servers and devices before he was forced to leave by the firefighters on scene.<\/p><p>Shortly after this all happened, I received a phone call from a coworker telling me that I shouldn't bother coming in today. Luckily, this all occurred around 9:00 AM, and I'm scheduled to start work at 10:00 AM.<\/p><p>After some time spent home catching up on some personal web stuff, I received another call: it's our network coordinator. We had a backup generator on scene, and were ready to turn things back on...<\/p><p>Shortly after I got to the office, we had almost all primary systems up and running. The only device that did not bounce back was our <abbr title=\"redundant array of inexpensive disks\">RAID<\/abbr> array. If you work in Warren County, your \"My Documents\" folder points to that device. That's <em>no bueno<\/em>. Our network coordinator hopped on the support line with Gateway (they sold us the device), and we overnighted a new one to the municipal center.<\/p><p>Back to today - we have the new device, and from what I hear they're putting it in right now and rebuilding the array. We may have to restore from backup, but at the very worst that means we lose two hours of work. Our main systems were down for around five hours - not too bad if you consider the circumstances.<\/p><p>This week has emphasized the importance of having a good backup plan, as well as a plan for emergency response. In the event of an emergency, having a set procedure saves a tremendous ammount of time and money, and allows you to bring everything back to operation.<\/p><p>Now, if only the plan didn't involve me coming in two hours early...<\/p>","date":"20070328123052","categories":["General"],"comments":[]},{"id":"24","title":"Linux - Customize Your Noose","body":"<p>My new year's resolution is to switch to Linux - specifically one of the <a href=\"http:\/\/www.ubuntu.org\">Ubuntu<\/a> variants. I'm sick of using <a href=\"http:\/\/www.microsoft.com\/windows\/default.mspx\">Windows<\/a> and supporting <a href=\"http:\/\/www.microsoft.com\">Microsoft<\/a> in it's efforts to remove the rights of it's users. <strong>Linux can (technically) do absolutely anything I need it to do<\/strong>, the trick is getting from here to there.<\/p><p>After much deliberation, I've decided to use <a href=\"http:\/\/www.kubuntu.org\">Kubuntu<\/a> flavor. I really like the others (especially <a href=\"http:\/\/www.xubuntu.org\">Xubuntu<\/a>), but Kubuntu just seems like the best fit. So, I install the distro on my second hard drive, and most everything works automatically. Being somewhat of a perfectionist, I automatically start yearning for my dual-screen setup and wireless network. This is where the pain begins.<\/p><p>First of all, I must add that none of these problems are limited to Kubuntu. Dual-screens has to do with the underlying <a href=\"http:\/\/www.x.org\">X.Org<\/a> system, and lack of comprehensive wireless support crosses all distributions.<\/p><p>With that said, <strong>I completely destroyed X.Org<\/strong> by trying to add a second screen. No warning, no second chance, just a callous-looking command prompt with some errors. After the third install, I figured out that I was really just mucking up the xorg.conf file - I saved a copy of that to my home directory, and in case of nuclear holocaust, I simply restored the configuration file. Not that hard to overcome, but I'll be damned if it didn't take a ton of time and effort. I can also tell you how many normal users would be willing to go to those extremes to keep their system up and running with Linux...<\/p><p><strong>I still have not been able to configure my wireless card<\/strong>. If I was a little more flexible in my requirements, things would not be so difficult - but I have a degree in networking. I am not willing to settle for anything short of WPA security, with my own configuration (AES encryption, pre-shared key, channel 8). The fact that Ubuntu (and I'm guessing it's the same with Xubuntu) does not have a built-in way to do this is unacceptable. By installing a separate application in Kubuntu I can get <em>some<\/em> of the options I need, but this has not let me get my wireless network up and running. I've tried several fixes on the internet, none of which have worked, most of which have had me configuring a file that is no longer used in Ubuntu. I've been able to run CAT5 cable to my PC for the time being, but it will not last.<\/p><p>While I do appreciate the configurability of Linux, <strong>most users will not<\/strong>. The majority of users simply want something that works - which is why Windows is so popular. If you don't work in Windows, you can't compete in computing today. This is also why Macs are gaining popularity: they control the environment their operating system runs in, so everything works. With the growing importance of the Internet (which is cross-platform), Macs are becoming a viable alternative.<\/p><p>The only way Linux is ever going to survive on the Desktop is if it becomes one of the operating systems that \"just works\" out of the box. The efforts of Ubuntu and other distributions just may make this possible, but it's still a long way off.<\/p>","date":"20070322123109","categories":["Linux"],"comments":[]},{"id":"25","title":"The System Is Down","body":"<p>One of the perks of my job is the flexible schedule that goes along with it - I come in around ten, and nobody minds too much if I'm a couple (20) minutes late as long as I make up the time somewhere else.<\/p><p>One of the crappy parts of my job is the flexible schedule that goes along with it - I leave at six, unless I'm not done.<\/p><p>Tonight was one of those nights. We were upgrading one of the servers, and since I work after hours, I was the prime candidate for doing it. Just a simple RAM upgrade, right? No problem. Except it's a server upgrade, and the servers in question just happen to house the financial system that manages the whole county's purchasing and payroll. Goody goody.<\/p><p>So shortly after 5:30 PM, I start hunting down the stragglers that are still logged in (turning off the financial system with people working on it is a great way to get your tea poisoned), and Payroll informs me that they can be done by 6:00 PM. So, I'm starting after my shift ends. But six rolls around, they log off, and I get started.<\/p><p>For those of you who have never seen a server room, it looks like this: There are dozens of servers sandwiched together in what we affectionately call a \"rack\". If they're put in right, it's a great way to conserve space. If they're not, it's a great way to make them hard to work on.<\/p><p>The first server was not easy to get out. Instead of being mounted on rails that slide out, it was simply screwed to the side of the rack. So, instead of sliding it out and doing the upgrade, I had to wrench the thing out of place and plop it on a desk somewhere. The case required two people to open, so I had to grab a janitor - The night crew are great people. Anyways, that was finished with, so I wrestled it back into place and moved on to server #2.<\/p><p>The first thing I noticed was that this server was installed right, and slid right out. The rails it was on kept it suspended in mid-air right in front of me, which was nice.<\/p><p>The second thing I noticed was that it was completely exposed already. There was no case to remove, I was already staring at the internals of the server. Apparently the last time anyone worked on this server, they neglected to put the case back on. That was three years ago.<\/p><p>If one of the battery backups directly above this server had leaked, the County could have lost millions of dollars in records (all the way back to 2004), as well as millions of dollars worth of work. I quickly did my maintenance, dug the rest of the case out of a corner, and reassembled the thing.<\/p><p>I ended up getting out an hour late, but everything went pretty flawlessly with the upgrades. All in all, things could have gone much worse, and this has definitely shown me how valuable a good initial setup is. Without it, everything from that point on becomes an exercise in torture.<\/p>","date":"20070320123214","categories":["General"],"comments":[]},{"id":"26","title":"Spell Check Savior","body":"<p>I recently set up the spell check functionality in my text editor, something I have been meaning to do for quite a while. I am migrating the <a href=\"http:\/\/www.co.warren.ny.us\">county<\/a> to a new layout, and I'm revising the text of pages as I go along. Because misspelled words reflect very poorly on the author and their credibility, I thought that spell checking everything couldn't hurt.<\/p><p>I should have been doing this years ago, as I have discovered spelling errors on <em>current<\/em> wordings as well as the new type I'm adding. For instance, if you visited the government page in the past few years, you could have used one of our helpful links to get a listing of all the \"deptartments\" in the federal government.<\/p><p>The text editor I use, <a href=\"http:\/\/www.pspad.com\">PsPad<\/a>, has a built-in spell check function, as does <a href=\"http:\/\/www.adobe.com\/products\/dreamweaver\/\">Adobe Dreamweaver<\/a>. If you use any of these editors, <strong>use the spell check function<\/strong>. If you use another editor, make sure it has this feature. While I haven't thought much of spell check in the past, I would now put it alongside syntax highlighting in matter of importance. The best web site out there is only as good as it's content, so make sure your content is correctly spelled!<\/p>","date":"20070217123315","categories":["General"],"comments":[]},{"id":"45","title":"Browser Competition is Good","body":"<p>I recently checked out the <a href=\"http:\/\/www.w3schools.com\/browsers\/browsers_stats.asp\">browser statistics page<\/a> over at <a href=\"http:\/\/www.w3schools.com\">W3 Schools<\/a>, and was pleasantly surprised by what I saw. The chart indicated that <strong><a href=\"http:\/\/www.mozilla.com\">Firefox<\/a> had grown to a 31% market share<\/strong> in the year of January. Holy smokes! Do we have the kind of leverage we need to influence the standards compliance of <a href=\"http:\/\/www.microsoft.com\">Microsoft's<\/a> <a href=\"http:\/\/www.microsoft.com\/windows\/products\/winfamily\/ie\/default.mspx\">Internet Explorer<\/a>? Will they finally have to clean up their act to stay alive in the browser game?<\/p><p>...No. No they won't. Unfortunately, the rosy statistics displayed on the browser statistics chart are not being felt everywhere just yet. On all of the pages I manage, I've only been able to see a small drop in <abbr title=\"Internet Explorer\">IE<\/abbr>'s supremacy over the past year or so. On the whole, my traffic statistics tell me that <strong>90% of my visitors are still using IE 6 or IE 7<\/strong>. Firefox usually has the second highest percentage, between 5-10%, with browsers like <a href=\"http:\/\/www.apple.com\/macosx\/features\/safari\/\">Safari<\/a> and others making up the slack. Even if I did see the kind of statistics that W3 does, I would still have to make IE compatibility one of my top priorities. If it doesn't render perfectly in IE, then it's not worth my time, because the majority of my visitors would not see the best quality available.<\/p><p>Hopefully, whatever market share percentage it is losing will help Microsoft to realize that it's users are looking for a better experience. I do not believe IE7 delivers that just yet, but I have high hopes for the next few iterations of the browser. Microsoft has seen different alternatives gaining popularity due to the problems they've faced, and will have to start cleaning up their act if they wish to secure their future as a contender in the browser market.<\/p>","date":"20070210134352","categories":["General"],"comments":[]},{"id":"44","title":"Printer Un-Friendly","body":"<p>I'm mad as hell, and I'm not going to print it anymore.<\/p><p>For the love of cranberries, folks. I have a big problem with web sites that look fine and readable on the screen, but look like a train wreck when you print it out. It would be easier to overlook if it wasn't for the ease of setting up a printer friendly stylesheet.<\/p><p>Creating a stylesheet that's only used when printing saves toner\/ink, paper, and a lot of frustration. How many times have you printed out a great article, or a solution to a problem, only to find that half the text is chopped off? That only half of the paper is used by content, and the rest is used up by ads and navigation links that are useless on a printed page? Setting styles in place to hide navigation and other web-only elements is a very easy way to make your page much more usable, and maybe even keep visitors from going elsewhere. Here's a simple way to use external stylesheets to do the trick:<\/p><p class=\"code\">&lt;link rel=\"stylesheet\" type=\"text\/css\" href=\"print.css\" <strong>media=\"print\"<\/strong> \/&gt;<\/p><p>So please, if you have content that you can print, create a stylesheet for print media. It's easy, and adds a level of quality to your site that's very noticeable.<\/p>","date":"20070106134146","categories":["CSS"],"comments":[]},{"id":"43","title":"Meaty Dilemma","body":"<p>I received my first comment on this blog the other day.<\/p><p>I don't believe I write just to get feedback, so I don't mind if my blog goes unnoticed. It doesn't really bother me. However, getting a comment does kinda let you know that there's someone out there that likes what you're writing. Somebody who can use what you're putting out there.<\/p><p>So, when I saw the number of comments on my most recent entry had increased to one, I was pretty excited. I opened up the entry, and lo and behold...<\/p><p>There was twelve pages of mumbo-jumbo and a dozen links at the bottom. I had been spammed.<\/p><p>So, I enabled comment moderation, and re-published the blog. Lesson learned. I guess CAPTCHAS can't keep the spammers at bay forever...<\/p>","date":"20061120134029","categories":["General"],"comments":[]},{"id":"42","title":"The Gauntlet","body":"<p><em>The Project<\/em>: Bring the <a href=\"http:\/\/www.visitlakegeorge.com\">Warren County Tourism web site<\/a> in-house, taking control from a vendor that was payed $1 million last year for that and other tourism-related work.<\/p><p><em>The Site<\/em>: In existence for the better part of seven years, it has passed from vendor to vendor. The initial vendor coded using <a href=\"http:\/\/www.adobe.com\/products\/coldfusion\/\">ColdFusion<\/a> and <abbr title=\"ColdFusion Markup Language\">CFML<\/abbr>, and their stuff was written for ColdFusion 4. The newest guys have been coding in <a href=\"http:\/\/www.php.net\">PHP<\/a>, and somewhere someone tossed in some <a href=\"http:\/\/asp.net\/\">ASP.NET<\/a>. It's database driven, uses Flash, and the source for the page weighs in at 400 MB. That's without the database of content, too. The table listing for the database is two pages long.<\/p><p><em>Time frame<\/em>: Six weeks, starting last Monday.<\/p><p>Can we do it? As the only web developer at Warren County, I'm a little bit worried to say the least. I've got one of our programmers helping me out with database and project details, and my department head is keeping the bureaucratic bullshit off of our backs, making sure we can do our jobs. We may be hiring consultants, we may be buying servers. I may be buying stock in Pepsi Co. and Mountain Dew, just because I believe I will be investing quite a bit in their product  soon.<\/p><p>But I think we can do it. At least get it working, at the very least.<\/p><p>Can we do it by December 31st, when the contract runs out with the old guys, and the switchover happens whether we're ready or not? Well, I don't think it matters what I think there. It's gonna happen one way or another, even if I have to sit myself in front of a terminal and write the HTTP response headers myself. Come January 1st, 2007, you're going to be able to open the tourism page without any problem. The question is, how much of Christmas will I be around to enjoy? :-)<\/p>","date":"20061118133952","categories":["General"],"comments":[]},{"id":"41","title":"OpenOffice.org - One Barrier Down","body":"<p>I've been trying to phase out my use of proprietary software like <a href=\"http:\/\/office.microsoft.com\/en-us\/default.aspx\">Microsoft Office<\/a>, just because it makes a lot of sense to me. Not paying for software, supporting open source, using <a href=\"http:\/\/www.oasis-open.org\/committees\/tc_home.php?wg_abbrev=office\">open document formats<\/a>: all wonderful things. But, using products like <a href=\"http:\/\/www.openoffice.org\">OpenOffice.org<\/a> has a few disadvantages: one of which I have overcome today.<\/p><p>One of the things I really enjoy about Microsoft Excel is it's well-placed hot key to bring up the 'Cell Formatting' dialog. By pressing CTRL+1, you are given all the options you need for the cell you're currently working in.<\/p><p>OpenOffice.org, however, does not have any default hot key set to the 'Cell Formatting' dialog. I didn't lose sleep or anything over this, but it was definitely the raspberry seed in my rectum - err, wisdom tooth - for quite a while now. Often I could be heard in the office, swearing a dark oath to my pagan computer gods, that I would do anything for that simple shortcut. Well, the dark lords have heeded my call, and I will share their sweet, forbidden knowledge with you.<\/p><p>OpenOffice.org, being cooler than sliced bread, allows you to customize your keyboard shortcuts. To do this, go to the 'View' menu, and under the 'Toolbox' sub-menu, select 'Customize...'. From there, if you click on the 'Keyboard' tab, you can assign all sorts of keyboard shortcuts to all sorts of functions. The particular one I was interested in was the CTRL+1 combination. To change that shortcut, I simply clicked on the combination, and chose the dialog box I wanted. In this case, it was under the 'Format' category and the 'Format Cells' function.<\/p><p>The only difficulty I ran into was due to a misunderstanding on my part. At first, I was looking for 'Cells...' under the function section, because that's what it says in the 'Format' drop-down menu. Instead, functions are either sorted by the name of the function, or the dialog box they call up. When you click on the 'Cells...' menu option, it brings up the 'Format Cells' dialog box.<\/p><p>One more step on being completely happy with free and open source software. It's the little things that keep me going.<\/p>","date":"20061104133839","categories":["General"],"comments":[]},{"id":"40","title":"PHP, ASP, VB, Oh My","body":"<p>I'm not sure whether I've discussed this before are not, but I have a very big part in a very large choice that's about to take place in our office. We're at a turning point in the IT department, one that will effect us for a very long time - possibly the next decade or so. We need to decide on a development language to use: for web, for applications, and anything else we might do.<\/p><p>Currently, we are using FoxPro for our desktop applications, and PHP on the web side. Our IT Director is pretty pro-Microsoft, and only allowed me to use PHP when an old co-worker informed him of how much they were using it at his current place of employment. However, he's pretty much on the fence about where we should go next.<\/p><p>Microsoft has shown no interest in supporting FoxPro, even though it's a fantastically fast language that comes built-in with it's own database. That leaves our in-house applications looking like they were straight out of Windows 3.1. Our director would like to (if possible) use a unified language for both web and application development, because he would like to see the two become much more closely tied. \"The web is the future\", as they say.<\/p><p>So, we're re-writing an in house application in ASP.NET to see what it's like. I have a bunch of PHP development under my belt, so I know what that's like. So, my opinion will have a big part in the final choice.<\/p><p>Here's hoping my opinion leads to the best answer...<\/p>","date":"20061020133747","categories":["General"],"comments":[]},{"id":"39","title":"Robots Run Amok","body":"<p>Here at <a href=\"http:\/\/www.co.warren.ny.us\">the County<\/a>, we're getting hammered by a web crawler named \"Pita+\". The only information it provides for itself (and the only information I could find on it) was an e-mail address, which was 'webmaster' at 'pita.stanford college'. It didn't actually say 'pita.stanford college', but I'd rather keep that e-mail address spam free, even if it's spamming our site.<\/p><p>Here at the county, we sit on a lowly T1 line, which means getting hammered is pretty effective; and here at the county, we have around two gigs of downloadable schtuff. So, getting hammered by an over-zealous web crawler is really kicking the internet line's ass.<\/p><p>For now, I've added a line to our Robots.txt file disallowing the files being assaulted, and e-mailed the webmaster to see if Pita+ will obey robot guidelines such as \"Crawl-Delay\". However, our upstream bandwidth is still hitting the roof, and I'm currently only able to \"ask politely\" for them to stop. Perhaps, if this continues, I'll look into more forceful ways of controlling our visitors.<\/p><p>Oh, if you're interested, here's the full user string for the robot:<\/p><p>171.64.75.174 Pita+(webmaster@pita.stanford.edu<\/p>","date":"20060906133543","categories":["General"],"comments":[]},{"id":"38","title":"Burnin' Down The House","body":"<p>A few days ago, the tallest building in <a href=\"http:\/\/cityofglensfalls.com\/index.asp\">Glens Falls<\/a> caught fire. It was an electrical fire on the 10th floor, and it shut down the building and almost every office in it.<\/p><p>The <a href=\"http:\/\/www.co.warren.ny.us\/ofa\/\">Warren County Office for the Aging<\/a> is located on the 3rd floor of that building. They got the next day off.<\/p><p>Two days after it happened, we had them up and running in a small spare room  in the municipal center. Instead of missing their files and not being able to work, their biggest worry was the annoying squeak of their hand-me-down chairs.<\/p><p>We had their server up and running within three hours of being allowed into the building to retrieve it. Six spare workstations were converted into fully-functional OFA PCs before they arrived. Their phones had been forwarded to the new room, with no changes visible to the outside. By the time I arrived to work that day, they had full access to everything they had at their office. The robustness and scalability of our network surpassed even my expectations so much that the only thing they could complain about were the squeaky chairs.<\/p><p>This is the power of a well run network, this is the result of our IT department organizing and becoming a force to reckon with. And the best thing?<\/p><p>We've only begun. I love my job.<\/p>","date":"20060722133326","categories":["General"],"comments":[]},{"id":"37","title":"The Little Browser Box","body":"<p>Our Telecomm guy had a suprise for me the other day: one of the <abbr title=\"District Attorney\">DA<\/abbr>s was getting a Blackberry, and he had it for a little bit. He stopped by, and brought up the Warren County web site.<\/p><p>No <abbr title=\"Cascading Style Sheets\">CSS<\/abbr>, No Javascript. Just the beautiful text of our site, and a few images that aren't gracefully implemented yet. All of the useability crap I've been struggling to implement actually payed off. <em>Fantastic<\/em>.<\/p><p>It's good to know that some of the things that we do as web designers is not just because it's the \"Right Thing To Do\". Somebody's going to enjoy using our site because we put effort into being useable. Kinda makes it easier to go back and hack through another accessibility hell with the next new page, you know?<\/p>","date":"20060715133100","categories":["General"],"comments":[]},{"id":"36","title":"Adobe Acrobat Crashing?","body":"<p>This has been driving me crazy for <em>YEARS<\/em>! Adobe Acrobat's Distiller feature constantly crashes, no matter what I'm using it for. But now, I have a solution.<\/p><p>You know that little 'acrotray.exe' program that Adobe has running in the background? The one that most people eliminate because it just takes up memory? Well, turns out it is required to run the Distiller. Open it up, and all your Distiller woes are gone.<\/p><p>Thanks go to Frederik Slijkerman for the solution. Found his post on a <a href=\"http:\/\/discuss.joelonsoftware.com\/default.asp?joel.3.139348.26\">message board<\/a>.<\/p>","date":"20060605133015","categories":["General"],"comments":[]},{"id":"34","title":"Living in a Flashless Society","body":"<p>Recently at work, I received a new workstation. This was necessary, because my old workstation was pretty quirky and very slow. But that's neither here nor there.<\/p><p>After getting my workstation set to my liking, I ended up browsing the web a little bit. A few pages in, I noticed that I wasn't getting any ads. 'That's funny,' I thought to myself, 'I haven't installed <a href=\"http:\/\/adblock.mozdev.org\/\">AdBlock<\/a> yet.' A few more pages, and it hit me; I hadn't installed <a href=\"http:\/\/www.adobe.com\/shockwave\/download\/index.cgi?P1_Prod_Version=ShockwaveFlash\">Flash<\/a> yet, either. After that, the waves of epiphany came crashing down.<\/p><p>Flash has never touched my workstation, and I don't think it ever will. Most web sites are perfectly useable without flash, and many that aren't are not worth visiting in the first place. As an added bonus, I haven't been asked to \"Hit the Monkey\" or \"Stretch the President\" or \"Claim your free iPod\" since I went about this behavior. That creepy 'talking head', advertising speech synthesis services, has all but disappeared. The dancing silhouette girl? She's a no-show.<\/p><p>Not having to deal with obtrusive, annoying flash ads is a great benefit to keeping the plugin away from my browser, and I highly recommend it to anyone who is less concerned with being the lucky 317,496th visitor and more concerned with getting stuff done.<\/p>","date":"20060501132717","categories":["General"],"comments":[]},{"id":"35","title":"Your Mission, If You Choose to Accept It","body":"<p>The plain red second hand of the plain brown wall clock struck twelve, registering ten thirty in the morning. It was Saturday; a single bead of cold sweat rolled down my left temple. It was time. With a few quick keystrokes, I opened Remote Desktop and type in the name of our web server.<\/p><p>I was <em>ready<\/em> for this, damnit. I even had a test server to the right of me, humming along, in which I had tested the upgrade yesterday. It was still there, perfectly intact, running a near mirror of the software we were using on the web server. Everything was fine - it actually went unnervingly well. Upgrades never go this well, but there it was. I had meticulously crafted a set of instructions, documenting each step. I had tackled just about everything. I even had a maintenance web site set up in <a href=\"http:\/\/www.microsoft.com\/WindowsServer2003\/iis\/default.mspx\"><abbr title=\"Internet Information Services\">IIS<\/abbr><\/a>, one that would catch unwary visitors that tried loading the page during the maintenance window, and inform them of what was happening. Like I said, <em>I was ready for this<\/em>.<\/p><p>With the maintenance site in place, catching any traffic that hit the web server, I took down the main site. I clicked around the management console quickly, efficiently changing references and upgrading the script engine that our templates use. After the last component of IIS was altered to use the new version, I held my breath and re-started the main site. The maintenance web site was still catching all traffic, so I could safely test the site inside the sterile environment of our office, instead of opening it up to the world and hoping for the best. So I opened up a web browser and called up the main page of our site.<\/p><p style=\"font: 10px 'Courier New', monospace;\">Invalid access to memory location<\/p><p>\"Run for it rollback restore from backup move to Mexico blame it on the network guy switch back to static <abbr title=\"Hypertext Markup Language\">HTML<\/abbr> check over the instructions just do SOMETHING!\" ran through my mind as the error registered with my brain. Invalid access to memory location? What a rather vague, rather dire error message. Luckily, I knew there were very few differences between the main web server and the test server I had set up: one of which involved application pools.<\/p><p>On the web server, I had created a separate application pool as an attempted fix for IIS errors I keep receiving. After switching back to the Default app pool, I loaded up the site once again, praying to the secret technology deity that people don't like to talk about. The site appeared flawless, but I wasn't convinced. I loaded up a page I knew depended on scripts quite heavily, the contact scripts, and sent a message to myself. Moments later, my mail client 'dinged'. Crisis averted. We were patched, and the server now had the latest version and was a little more secure because of it.<\/p><p>This behind-the-scenes computer work is why I love the field of technology. The fact that anyone working in IT is fighting a secret war against crackers and script kiddies is sometimes exhausting, sometimes exhilarating. Forever patching, watching exploits, trying to stay ahead of the game. Sure, most of the work we do is thankless, but it does come with a sense of pride. Knowing that everyone else in the industry knows how hard keeping up to date is definitely gives you a vague sense of community. If that isn't enough satisfaction, the adrenaline rush after a successful upgrade is enough to keep me hooked.<\/p>","date":"20060429132856","categories":["PHP"],"comments":[]},{"id":"33","title":"Bits and Bytes","body":"<p>All ye connecting with phoneline modems, all ye who make sandwiches while waiting for files to download, <em>I feel your pain<\/em>. For I am a web minimalist.<\/p><p>You can often find me pouring over <abbr title=\"HyperText Markup Language\">HTML<\/abbr>, over <abbr title=\"Cascading Style Sheets\">CSS<\/abbr>, looking to trim out unneeded characters. Comments are wonderful for explaining the reasoning behind code, but with CSS and HTML, visitors download those explanations along with the code that makes everything work. Comments had to go. When I found out that the normal hexadecimal format for naming colors (a pound sign [#] followed by six numbers) could be simplified for any colors within the web-safe 256 colors, I instantly shrank all of my blacks and whites (along with anything else I could). It only saved three bytes here and there, but I like to think about it using ridiculous figures.<\/p><p>In 2005, the <a href=\"http:\/\/www.co.warren.ny.us\">Warren County web site<\/a> had 158,569 hits (that were recorded; We don't monitor all pages yet). Let's say we get that many this year as well (even though it looks like we'll get more). The size of the Warren County web site main page, in 2005, came in around 83.4 KB. If that was downloaded 158,569 times, that rings in around...  13.2 GB of traffic. Holy shit.<\/p><p>With my minimalistic tendencies, I've gotten it down to about 59.17 KB, all while adding three 300px X 150px images. You have no idea how happy this makes me. But nevertheless, if this page was downloaded as many times as the 2005 version was, the total bandwidth used would be 9.4 GB. Saving nearly 4 GB a year in bandwidth is nothing to shake a stick at.<\/p><p>Regardless, this is not a highly trafficked site. Simple CSS and HTML minimalism, applied to a site that gets millions of hits a month, could theoretically save a company thousands in bandwidth costs, not to mention saving those with slow connections the trouble of having to download your bulky site. Our smaller site takes a little over one second on a full 56K connection, which must come as a great relief to people that use that to come to our site. In the age of multi-megabyte web sites with flash, videos, music, and more, the guys who keep their sites small seem to fall into good favor with search engines - and the percentage of people still dialing into the internet.<\/p>","date":"20060422132615","categories":["General"],"comments":[]},{"id":"32","title":"Opera 9 Stole My Brain","body":"<p>First of all, let me disappoint you by starting off with a disclaimer: This probably won't be as funny as it could be. If you're looking for ha has, check out <a href=\"http:\/\/slashdot.org\/\">PinkDot<\/a> [slashdot.org]; a new, softer, pinker, more unicorn-laden side of the News for Nerds.<\/p><p>Alright, back on topic. I downloaded the latest <a href=\"http:\/\/www.opera.com\">Opera<\/a> [opera.com] browser, Opera 9.0 Preview 2. After it was all installed and I was presented with the familiar Opera browser window (not too many <abbr title=\"User Interface\">UI<\/abbr> changes on the surface), I loaded up one of my pages. I was absolutely astounded.<\/p><p>I have always been an Opera browser fan, due to it's excellent code rendering and devotion to web standards. But this new edition seems to have climbed into my brain to borrow my view on how pages should be rendered. I loaded up the <a href=\"http:\/\/www.co.warren.ny.us\/\">Warren County<\/a> [www.co.warren.ny.us] site, and found it perfectly rendered to my intents. Opera 8.X had goofed my accessibility bar on the top by adding a margin out of nowhere, but Opera 9 rendered it snug to the edges of the browser window. In fact, everything looked just as I invisioned when I was designing it. Opera even agreed with me on a CSS issue I had dealt with; there's a CSS fudge I had to add in there to make a page element show up correctly in all major browsers. Opera 9 took that, and rendered the fudge just as I imagine it should have been rendered. It offset the element to reflect the CSS I added, and rendered it correctly when I took it out. On a rainy Saturday, that really makes me smile.<\/p><p>I've been using the <abbr title=\"Internet Explorer\">IE<\/abbr> 7 Beta as well, and it astounds me how far it has to go and how little has changed. Shiny tabs and a few band-aids on glaring rendering issues do not a new browser make. Opera has always been ahead of the pack in my opinion, and I've noticed that the <a href=\"http:\/\/www.mozilla.com\/\">other<\/a> [mozilla.com] <a href=\"http:\/\/www.microsoft.com\/ie\/\">browsers<\/a> [microsoft.com\/ie] tend to take note of Opera's innovations, even if it takes a while. Opera's new rendering changes give me hope that web design as a whole will, someday, become less of an exercise in patience.<\/p>","date":"20060401132540","categories":["General"],"comments":[]},{"id":"31","title":"Oh I'm a lumberjack and I'm okay...","body":"<p>I've been getting <abbr title=\"Internet Information Services\">IIS<\/abbr> worker process errors lately. I can't really track them down to a certain page or a specific recurring time of the day, and it's driving me crazy. As a last resort, I re-enabled logging on the main <a href=\"http:\/\/www.co.warren.ny.us\/\">Warren County<\/a> site. It turns out that I still have quite a bit to learn about a server administrator: I should have been doing this for months.<\/p><p>As I gazed into the depths of the logs, a startling set of records caught my attention. While I wasn't able to find any reason for the errors in the IIS worker process, I was able to find several attempts to hack our server. A particular <abbr title=\"internet protocol\">IP<\/abbr> address (83.16.187.6, if you're one of those vengeance-types) showed up several times, trying to access applications we didn't have. Not only that, but they were trying to send some very suspicious requests to our server for those applications, requests that probably have been covered in security bulletins and the like. And that was just the beginning.<\/p><p>Through the logs, I found that a lot of other people are trying to get our \"favicon.ico\" file for some reason ('favicon.ico' is that customizeable icon that appears next to the title of a page). We don't have one, so they're pretty much out of luck, but I may just add one now that I know something's requesting it. I found an IP address for the Albany NY Public Safety Internal Site. I found exactly why it's good to have <a href=\"http:\/\/www.webdav.org\/\">WebDAV<\/a> disabled. I found that on March 11, I did something that screwed up our web template and two people tried to use a stylesheet named \"null\". If you're reading this and you're one of the two people... well, shucks. Sorry about that.<\/p><p>I've often wondered why so many administrators preach about the importance of reviewing logs, why so many intelligent people would scan through the thousands and thousands of lines of meaningless access requests, and now I've successfully cornered several dead incoming links that have been evading me for months and possibly been alerted to malicious attempts to deface our site. Well, christen me converted.<\/p>","date":"20060318132457","categories":["General"],"comments":[]},{"id":"30","title":"DOM Inspector: Sliced Bread, Eat Your Heart Out","body":"<p>It's been a rough week, but my overdue discovery of the <abbr title=\"Document Object Model\">DOM<\/abbr> Inspector built-into <a href=\"http:\/\/www.mozilla.com\/\">Firefox<\/a> may have just made my day.<\/p><p>For those of you still struggling with the cryptic subtle ways of the <abbr title=\"Hypertext Markup Language\">HTML<\/abbr> DOM, this is for you. I've recently been trying to come up with an accessible, unobtrusive collapse\/expand script that takes advantage of the DOM structure to do it's dirty work. After dabbling with recursive Javascript functions, I soon realized that I was in so far over my head that I could barely see daylight. After pushing the script aside for a few days, I decided to bring up the DOM inspector to see if it would shed any light into the problems I was encountering.<\/p><p>After fiddling with a few of the displays, I hit the jackpot: the \"Object: Javascript Object\" view. Spread out before me were all the options and attributes I was trying to utilize. FirstChild properties, nodeType attributes, it was all there. All waiting for me to utilize like a magical bag of reagents.<\/p><p>Instead of writing the script, I instantly blogged about it. Of course. But now it's back to work, and hopefully I will have an accessible script to show soon. Stay tuned, kids.<\/p>","date":"20060309132313","categories":["General"],"comments":[]},{"id":"29","title":"Accessible Javascript - Ouch","body":"<p>To help increase the useability of the <a href=\"http:\/\/www.co.warren.ny.us\/\">Warren County web site<\/a>, I've been looking into accessible JavaScript. We currently use some expand\/collapse scripts, and they're real hokey. The function calls are hard-coded into the links, and expanding them is akin to taping on the additional code with duct tape. Due to my anal, perfectionist approach to this sort of thing, these scripts simply <em>have to go<\/em>.<\/p><p>With purely honorable intentions, I jumped face-first into the world of accessible JavaScript and promptly drowned. From what I can see, no one has a definitive answer to this problem. There are some great things going on, with <a href=\"http:\/\/www.quirksmode.org\/blog\/archives\/2005\/06\/you_shouldve_be_1.html\">You should've been @media<\/a> being one of the better ones in my opinion. However, what we're lacking is an answer. I've looked into DOM scripting, with events and functions littering each page I come across. Still, I've yet to find a good solid place to jump off from, and I think that will be the status quo for the next few months.<\/p><p>This is the kind of place I want to be, the kind of situation that makes me enjoy web design. Programming for an environment as volatile as the web is a great challenge, especially with the <a href=\"http:\/\/www.microsoft.com\/\">evils<\/a> at work and the <a href=\"https:\/\/www.microsoft.com\/windows\/ie\/default.mspx\">hurdles<\/a> that must be overcome. Creating something that a distractable 15-year-old wants to use that will also provide the same services for a grandmother with cataracts is a task worthy of any programmer. Things like accessible JavaScript are simply ways to persevere and make a name for yourself.<\/p>","date":"20060225123747","categories":["General"],"comments":[]},{"id":"28","title":"Web Accessibility - Balancing Elephants","body":"<p>Recently, I've been able to make a layout for <a href=\"http:\/\/www.co.warren.ny.us\/\">Warren County<\/a> that is too good to be true. It is completely standards compliant (xHTML 1.0 Strict, even!), very accessible (passes automatic verification on Sec. 508 and others) and still looks half good. It also works on all major browsers, degrades beautifully on those that don't support CSS, and only has some minor hiccups on browsers that have... \"misguided\" CSS support. It's taken tons and tons of work, and I just about peed my pants when I finished it. To a web designer, this is a thing of beauty. This is what we strive for.<\/p><p>This is the equivalent of balancing an elephant on your chin.<\/p><p>This is also why most people are not standardized or accessible. Designing a good web site should not be this hard! As far as I know, Warren County will be the only county in New York State whose websites meet these criteria, and it has been mandated in the state for years. Even the state web site does not meet these criteria.<\/p><p>Until the state of the Internet changes, I can't seriously recommend people get into web design as a profession. It's a terrible thing to say, but web design is less of a programming skill and more of a hacking technique, and until that changes it's a extremely unstable world to walk in. We can only hope that future developments will make designing web sites les of a hassle and more of an enjoyable practice.<\/p>","date":"20060205123606","categories":["General"],"comments":[]},{"id":"27","title":"Ask, and Ye Shall Receive","body":"<p>The Board of Supervisors believe that I should be updating the site more often, and despite my great excuses, they are right.<\/p><p>Even though I would like nothing more than to do nothing but web design, it's kinda scary to have the much higher-ups light your posterior ablaze. The sudden scrutinizing attention sure does bring to light all your insecurities, and all of the ways I waste time.<\/p><p>...Speaking of which, writing in this blog using the <a href=\"http:\/\/www.mwbrooks.com\/dvorak\/\"> Dvorak<\/a> layout probably shouldn't be a high priority...<\/p>","date":"20060117123534","categories":["General"],"comments":[]},{"id":"22","title":"Sharepoint - First Impressions","body":"<p>Recently, the 'boss' came to me with a mission; <a href=\"http:\/\/www.microsoft.com\/windowsserver2003\/technologies\/sharepoint\/default.mspx\">Microsoft Sharepoint<\/a>. Investigate, dissemenate, procreate, whatever. We needed to know what it was, what it did, and if it will take care of our information flow issues. So it began.<\/p><p>Sharepoint is one way Microsoft can provide you with an intranet for your organization. It's almost completely web-based, and mixes in some <a href=\"http:\/\/en.wikipedia.org\/wiki\/AJAX\"><abbr title=\"Asynchronous Java and XML\">AJAX<\/abbr><\/a>-like functionality that allows you to manage everything. Of course, most of the <abbr title=\"Asynchronous Java and XML\">AJAX<\/abbr> elements only function properly if you're using the big blue 'e', but the site as a whole does work on versions of IE, Netscape, and even Mozilla 1.4 and higher. I'm using Firefox 1.5, and it seems to work just fine sans the administrative functions. If I need to change the site, I usually just load up the Sharepoint site in an IE tab.<\/p><p style=\"font-style: italic; padding: 4px;\">TIDBIT: if you do a lot of development work, and abhor keeping two or more browsers open, try the <a href=\"https:\/\/addons.mozilla.org\/extensions\/moreinfo.php?id=1419&amp;application=firefox\">IE Tab<\/a> extension for Firefox. <\/p><p>So overall, considering that Sharepoint Services is offered as a free add-on to Windows Server 2003 (As long as you already own a copy of SQL 2000), it's not that bad of a service. Definitely worth a glance if you're trying to get an intranet up and running quick-and-dirty style.<\/p>","date":"20051230122856","categories":["General"],"comments":[]}]